[
    {
        "url": "https://www.romanian-companies.eu/asian-food-srl-44855230/",
        "title": "Company ASIAN FOOD SRL tax code 44855230 from Romania",
        "text": "Company ASIAN FOOD SRL tax code 44855230 from Romania ROMANIAN COMPANIES Log in Mergi la site-ul nou Sign in with Google stay logged Create free account Account recovery Romanian English Home Databases Company List ASIAN FOOD SRL Search a company ROMANIA ALBA ARAD ARGES BACAU BIHOR BISTRITA NASAUD BOTOSANI BRASOV BRAILA BUCURESTI BUZAU CARAS SEVERIN CALARASI CLUJ CONSTANTA COVASNA DAMBOVITA DOLJ GALATI GIURGIU GORJ HARGHITA HUNEDOARA IALOMITA IASI ILFOV MARAMURES MEHEDINTI MURES NEAMT OLT PRAHOVA SATU MARE SALAJ SIBIU SUCEAVA TELEORMAN TIMIS TULCEA VASLUI VALCEA VRANCEA Search Advanced search Log in Mergi la site-ul nou Sign in with Google stay logged Create free account Account recovery Search a company ROMANIA ALBA ARAD ARGES BACAU BIHOR BISTRITA NASAUD BOTOSANI BRASOV BRAILA BUCURESTI BUZAU CARAS SEVERIN CALARASI CLUJ CONSTANTA COVASNA DAMBOVITA DOLJ GALATI GIURGIU GORJ HARGHITA HUNEDOARA IALOMITA IASI ILFOV MARAMURES MEHEDINTI MURES NEAMT OLT PRAHOVA SATU MARE SALAJ SIBIU SUCEAVA TELEORMAN TIMIS TULCEA VASLUI VALCEA VRANCEA Search ASIAN FOOD SRL First time here? Create free account or Access by SMS Company Identification data Trademarks Company description Video presentations Contact Map localization Activity domain Financial info Statistic info Old names ANAF status Status history Administrator history Shareholder history Working points SEAP auctions State debts Insolvency O.J. Files BPI ANAF More Trademarks ReCom file Similar companies Connected companies Identification data for ASIAN FOOD SRL Company Name ASIAN FOOD SRL Fiscal Code 44855230 Registry No. J12/4235/2021 EUID ROONRC.J12/4235/2021 Date of establishment 2021. . OSIM registered Trademarks None. About ASIAN FOOD SRL company Contact information of Asian Food like detailed information (balance sheets, court cases, registered trademarks, etc.) are available only for registered members. In order to get in touch with Asian Food or other companies included in catalog please login with your account. The active companyes are included on the Romanian-Companies CD and new features are available according the chosen access plan . Localization of ASIAN FOOD SRL - contact information. County Cluj City/District Loc. Cluj Napoca Address Str. Stephenson George 14 Ap. 4 Cod 400267 Phone - Mobile 0755-405.7 - - Email - 1 contacts removed Management people: Admin. Administrators Shareh. Shareholders Benef. Beneficiaries Web Address - Map localization Predominant activity domain (reported on the balance sheet) NACE Code 5610 Rev. 2 (like 5611,5612 Rev. 3) Activity Restaurants and mobile food service activities Activity Description This class includes - - Mmain activity domains (according registration certificate) NACE Code 56 - - (like 56 - - Rev. 3) Activity Resta - - Turnover Net Profit Debts Fixed Assets Current Assets Equity Ownership Employees (average no.) 2024 0 0 67 214 38 331 18 896 -9 987 0 2023 87 967 -10 036 65 454 38 327 17 141 -9 986 4 2022 175 719 5 755 57 571 43 679 20 724 6 832 5 202"
    },
    {
        "url": "https://lb.kompass.com/c/asian-food-srl/ro1340036/",
        "title": "\n            Asian Food Srl - Cluj-napoca 400267, Strada Stephenson George ...",
        "text": "Asian Food Srl - Cluj-napoca 400267, Strada Stephenson George ... Companies Products / Services Search too broad × Please refine your search by (Localization + What, who? Activity, company ...) Edit search Login / Register My account English Available languages عربي English Français Agriculture & Food Business Services Chemicals, Pharmaceuticals & Plastics Construction Education, Training & Organisations Electrical, Electronics & Optical Energy, Environment IT, Internet, R&D Leisure & Tourism Metals, Machinery & Engineering Minerals Paper, Printing, Publishing Retail & Traders Textiles, Clothing, Leather, Watchmaking, Jewellery Transport & Logistics Agriculture & Food Importers Exporters Service providers Producer Distributor Agricultural and forestry machinery and equipment Agriculture and forestry Beverages Food Food, drink, tobacco and catering industry machinery and equipment Livestock and fish Organic products Business Services Importers Exporters Service providers Producer Distributor Financial and insurance services Hire and rental services Hygiene and cleaning Services to businesses Chemicals, Pharmaceuticals & Plastics Importers Exporters Service providers Producer Distributor Chemical base materials Chemical industry plant and equipment Chemical products Health, medical and pharmaceutical Plastic products Rubber and plastic industry plant and equipment Rubber products Construction Importers Exporters Service providers Producer Distributor Building industry Civil and marine engineering contractors Civil engineering and building machinery and equipment Furniture and linen Hardware, ironmongery, cutlery and tools Heating, ventilation, air conditioning (HVAC) and refrigeration equipment Metal constructions for the building industry Metal pipework, valves and containers Security equipment Timber, wooden products, machinery and equipment for the woodworking industry Education, Training & Organisations Importers Exporters Service providers Producer Distributor Education and training International organisations, administrations and associations Social care, personal services Electrical, Electronics & Optical Importers Exporters Service providers Producer Distributor Electrical equipment. Nuclear equipment Electronic equipment. Telecommunications equipment Measuring and testing equipment Optical, photographic and cinematographic equipment Energy, Environment Importers Exporters Service providers Producer Distributor Energy, fuel and water Environmental services, renewable energies Oil and gas industry plant and equipment IT, Internet, R&D Importers Exporters Service providers Producer Distributor Information technology (IT) and Internet Research and testing Technical offices and engineering consultancies, architects Leisure & Tourism Importers Exporters Service providers Producer Distributor Hospitality, tourism, hotel and catering industries Leisure, culture and entertainment Postal services, telecommunications, radio and television Sports and "
    },
    {
        "url": "https://www.mirasia.ro/",
        "title": "Asian Food | MIRASIA FOOD | Romania",
        "text": "Asian Food | MIRASIA FOOD | Romania top of page MIRASIA FOOD The best Asian food in Europe For your healthy food OUR BUSINESS “Mirasia Food S.R.L is a leader in the import, trade, and distribution of retail and wholesale food from Korea in Romania. Our main target is to become the most respected company. For this reason, we concentrate our efforts for the satisfaction of the customers, and promote Korean and Asian food in all European local markets. We are engaged with the selection of best quality, providing a variety of products, and fast and reliable distribution.” OUR BRANDS ROLLING SUSHI GURI GURI GANGNAM POCHA PRODUCTS Our company directly imports goods from brands such as Bibigo, Samyang, Namyang, and other popular Korean food brands. View more Working With the Best Partners Success is not the key to happiness. Happiness is the key to success. If you love what you are doing, you will be successful. Albert Schweitzer bottom of page"
    },
    {
        "url": "https://bestfoodimporters.com/company/consali-expert-srl/",
        "title": "Consali Expert Srl - Importer, Distributor, Online Store",
        "text": "Consali Expert Srl - Importer, Distributor, Online Store Login Request Demo DEMO Consali Expert Srl www.asianfood.ro Asian Food is a Romanian company specializing in the import and distribution of authentic Asian ingredients and products. They offer a wide selection of items, including sauces, noodles, rice, and spices, catering to both culinary enthusiasts and professional chefs. The company emphasizes quality and authenticity in their offerings, ensuring customers have access to traditional flavors from various Asian cuisines. With a user-friendly online platform, Asian Food makes it easy for customers to explore and purchase a diverse range of products. Their mission is to provide a taste of Asia, transforming cooking experiences in Romania. Get Full Access Consali Expert Srl Products Confectionery & Snacks Ethnic Food Fruit & Vegetables Grains Juice, Soft Drinks & Water Olive Oil & Vinegar Organic & Health Food Pasta & Noodle Spices, Herbs & Seasonings Tea & Coffee Importer, Distributor, Online Store Employees 2-10 35 Strada Haller Károly Cluj-Napoca Județul Cluj, Municipiul Cluj - Napoca /asianfood.ro /asianfood.ro Potential Decision Makers Executive Director •••••••@••••.ro (•••) •••-•••• Show Details Similar Companies Mali Flower Srl Romania SHOW MORE Top Tea Company Srl Romania SHOW MORE Trans Alicom 2000 Srl Romania SHOW MORE Geraico Prodcom S.r.l. Romania SHOW MORE Jasmin Srl Romania SHOW MORE Reach decision makers at Consali Expert Srl Notice: JavaScript is required for this content. Consali Expert Srl FAQ How many employees does have? Consali Expert Srl have 2-10 employees Where is headquarters located? Consali Expert Srl is located in Județul Cluj, Municipiul Cluj - Napoca What is know for? Consali Expert Srl operates in the following sectors: Importer, Distributor, Online Store Company Search A B C D E F G H I J K L M N O P Q R S T U V W X Y Z Menu Black Friday 2025 – Get Free Months and Extra Users! Check Plans and Prices Notice: JavaScript is required for this content. x Notice: JavaScript is required for this content. x"
    },
    {
        "url": "https://mail.infoprofit.ro/firma/asian-food-srl-44855230",
        "title": "ASIAN FOOD SRL din Cluj-Napoca - CUI 44855230",
        "text": "ASIAN FOOD SRL din Cluj-Napoca - CUI 44855230 ASIAN FOOD SRL 44855230 Descrescator Crescator Cauta Detalii companie Denumire firma ASIAN FOOD S.R.L. C.U.I. 44855230 Nr. Înmatriculare J12/4235/2021 CAEN 5610 Data înfiinţării 06.09.2021 Stare companie 1048 - funcţiune Ai acces la o multitudine de informatii despre aceasta companie prin crearea unui cont gratuit. Creare cont Descriere Firma ASIAN FOOD SRL, CUI 44855230, a fost înființată la data de 06.09.2021 și are ca obiect principal de activitate codul CAEN 5610 - Restaurante Informatii Contact Adresa sediu STEPHENSON GEORGE 14 **** ? Oras / Sector Cluj-Napoca Judet CLUJ Tara Romania Indicatori companie (RON) An CAEN Cifra Afaceri Profit Net Datorii Active Imobilizate Active Circulante Capitaluri Proprii Angajati (nr.mediu) 2023 5610 437 600 -49 926 325 605 190 660 85 271 -49 674 4 2022 5610 869 351 28 472 284 828 216 097 102 530 33 799 5 2021 5610 288 585 5 118 227 333 172 519 59 932 5 118 2 Cifra de afaceri vs Profit Capitaluri Proprii Datorii Intrebari frecvente Cati angajati are compania ASIAN FOOD S.R.L.? In anul 2023 compania ASIAN FOOD SRL a avut un total de 4 angajati Care este cifra de afaceri și profitul companiei ASIAN FOOD S.R.L.? Cifra de afaceri inregistrata de ASIAN FOOD S.R.L. in anul 2023 a fost de 437 600 RON, iar profitul net -49 926 RON din care pierderi 49 926 RON. Care este activitatea principala a companiei ASIAN FOOD S.R.L.? Activitatea principala a companiei ASIAN FOOD S.R.L. este Restaurante Companii cu acelasi cod CAEN Denumire firma C.U.I. Nr. Înmatriculare DAMAZDRO SRL 17807391 J12/2708/2005 ORDINO IMPEX S.R.L. 8841610 J8/1239/1996 RUXI SRL 14203285 J36/283/2001 UNICA S.R.L. 1981072 J22/1810/1991 AMAC ORIZONT S.R.L. 18391041 J40/2560/2006 DALISILVA SRL 7395439 J38/285/1995 Companii din aceeasi localitate Denumire firma C.U.I. Nr. Înmatriculare ROMIN BALAN SRL 33663310 J12/2906/2014 ROYAL CHAIRS SRL 33663336 J12/2908/2014 MORENA CAFFE IMPEX SRL 33663344 J12/2910/2014 KALIMERA TEAM SRL 33462456 J12/2370/2014 SAN EXPEDITION SRL 33462081 J12/2369/2014 EMPIRICIST SOFTWARE WORKS SRL 33462499 J12/2372/2014 Folosim cookie-uri Acest site web folosește cookie-uri pentru a îmbunătăți experiența generală a utilizatorului. Aritați o privire la Politica noastră privind cookie-urile pentru mai multe informații. Numai elementele esențiale Acceptați tot Personalizați Cookie-uri esențiale Există câteva module cookie pe care trebuie să le includem pentru ca anumite pagini web să funcționeze. Din acest motiv, nu necesită acordul dumneavoastră. info_profit_cookie_consent 1 an 1 lună 1 zi Folosit pentru a stoca preferințele utilizatorului privind consimțământul cookie-urilor. info_profit_session 2 ore Folosit pentru a identifica sesiunea de navigare a utilizatorului. XSRF-TOKEN 2 ore Folosit pentru a securiza atât utilizatorul, cât și site-ul nostru împotriva atacurilor de falsificare a cererilor pe mai multe site-uri. More details Cookie-uri de preferințe Cookie-urile de preferință permit"
    },
    {
        "url": "https://www.facebook.com/consaliexpert/photos/",
        "title": "CONSALI EXPERT SRL",
        "text": "CONSALI EXPERT SRL"
    },
    {
        "url": "https://targetare.ro/44855230/asian-food-srl",
        "title": "ASIAN FOOD SRL din Cluj-Napoca - CUI 44855230",
        "text": "ASIAN FOOD SRL din Cluj-Napoca - CUI 44855230 Caută nume, cui, website, telefon, etc. ASIAN FOOD SRL Caută nume, cui, website, telefon, etc. ASIAN FOOD SRL Stare firmă: faliment Ultima actualizare a datelor: 19 nov. 2025 Risc de insolvență scăzut mediu crescut Informații generale Codul fiscal (CUI) al companiei ASIAN FOOD SRL din Cluj este 44855230 . Descarcă baze de date cu firme CUI 44855230 Reg. Comerțului J12/4235/2021 EUID ROONRC.J12/4235/2021 Data înființării 6 septembrie 2021 4 ani vechime Plătitor TVA TVA la încasare Split TVA CAEN 5610 - Restaurante Top firme CAEN 5610 Compania a fost înființată în anul 2021 și are 4 ani vechime . Date de contact GDPR ASIAN FOOD SRL poate fi contactată la numărul de telefon +40*****36 . Telefon +40*****36 Email - Website - Pagina de contact - Retele sociale - Adresa Jud. Cluj, Mun. Cluj-Napoca, Str. Stephenson George, Nr.14, Ap.4 Top firme din județul Cluj Top firme din Cluj-Napoca Administrator GDPR Be*****i Al*****u Sediul social al firmei ASIAN FOOD SRL se afla în Jud. Cluj, Mun. Cluj-Napoca, Str. Stephenson George, Nr.14, Ap.4 . Grafic evoluție companie Evoluția cifrei de afaceri, a profitului și a numărului de angajați pe ultimii 4 ani de bilanț disponibili. PIB RO reprezintă parcursul economic al României scalat la cifra de afaceri a companiei. Date financiare detaliate 2024 2023 2022 2021 Cifră de afaceri 100 Profit 100 Angajați 100 Datorii 334,327 3 Lichidități -32 - Mijloace fixe 190,660 0 Active circulante 93,993 10 Stocuri - Creanțe 94,025 10 Capitaluri proprii -49,674 0 Capital social 210 0 Conform datelor financiare din anul 2024 , riscul de insolvență calculat este unul crescut . Dosare în instanță Dosare în instanță unde a fost găsită ca și parte în dosar denumirea ASIAN FOOD SRL Identificarea dosarelor se face utilizând denumirea companiei În România pot exista firme diferite cu aceeași denumire, în astfel de cazuri identificarea dosarelor poate fi eronată. Vă rugăm să verificați personal corectitudinea datelor pe Portalul Instanțelor de Judecată . Calitate de Debitor în dosarul 379/1285/2024 Calitate de Debitor în dosarul 141/1285/2024 Calitate de Parat în dosarul 1173/296/2024 Calitate de Parat în dosarul 19303/211/2023 Calitate de Debitor în dosarul 14291/55/2022 Calitate de Parat în dosarul 14080/211/2022 Pagini web relevante Nu au fost găsite pagini web care ar putea avea legătură cu această companie. Evoluție companii similare Au fost găsite companii cu activitate / descriere asemănătoare cu cea a companiei ASIAN FOOD SRL CONACUL TUSINEAN SRL - - ROPATY MED SRL 3 - CIAO RAGAZZI SRL 24 - SOMAR CLUB SRL - - BLUE DOG INVEST SRL - - FANTASY FOOD FACTORY SRL-D - - MATIS PAST SRL - - MURANDY TRAKAND LOGITECH SRL - - TAR VALON ROAD SRL - - CARESA CATERING SRL 37 - Companii la aceeași adresă Au fost găsite și alte companii la adresa: Jud. Cluj, Mun. Cluj-Napoca, Str. Stephenson George, Nr.14, Ap.4 ELITE INVEST SRL 25 august 2023 CH CUSTOM MOB SRL 9 mai 2022 YOURBESTMOMENT SRL 29 noiembrie 2"
    },
    {
        "url": "https://www.asianfoodgroup.com/",
        "title": "Asian Food Group - Connecting Asian food within Europe.",
        "text": "Asian Food Group - Connecting Asian food within Europe. This website uses cookies to enhance your browsing experience. Accept Online Store Online Store Where flavours connect and stories unfold Reliable and innovative More than 80 years of experience As Asian Food Group, we are a bridge uniting cultures through authentic and inspiring Asian cuisine. Our mission is clear, to introduce authentic flavors to Europe by inspring our partners and enriching the experiences of our customers. Our aspiration is to be the preferred Asian Â (non-) food supplier. About us Step in to our world Blending heritage with innovation Together with our partners, we are dedicated to continuously improving our services. Driven by entrepreneurial spirits, we support growth opportunities, through data and adding value to our relationships. â Our diverse team, fluent in over 13 languages, ensures tailored advice and customer service, striving to understand and fulfill our partners' needs. Finding inspiration together through meaningful connections. We help businesses to be successful in todays competitive world. Get in touch + 25 exclusive a-brands + 3500 different products in stock + 35 countries we distribute to Reach out e: info@asianfoodgroup.com t: +31 (0)88 221 2000 Asian food group contact news assortment customers services about us asian food group history mission vision company video terms & conditions disclamer cookie policy privacy policy Wambay"
    },
    {
        "url": "https://tasteofasia.ro/?srsltid=AfmBOormjzYQh1p0ic2oe0kvYGpAr08uouX3bAQg268jTD759mr1qVAb",
        "title": "Magazin de produse asiatice ⛩️",
        "text": "Magazin de produse asiatice ⛩️ Livrare 24 - 48h ⦾ (+40) 724 584 948 | L-V: 09:00-16:30 Listă favorite {{ produsWish.title[currentLang] }} {{ produsWish.default_variant.price_selling.verbose }} | {{ produsWish.default_variant.price_list.verbose }} lei x 1 buc. Vezi lista completă CONTUL MEU Autentificare / Înregistrare COȘ COMANDĂ {{ basket.total_qty ?? 0 }} prod. / {{ basket.subtotal_verbose }} lei ADAUGĂ PRODUSE LA FAVORITE! Pregătește-ți coșul de cumpărături pentru Black Friday! Începem vineri, 21 noiembrie SELECȚII VARIATE DE PRODUSE Explorează selecțiile noastre de produse și alege ce ți se potrivește VEZI COLECȚIILE CATALOGUL TOAMNEI Răsfoiește catalogul și vezi cele mai noi oferte VEZI CATALOGUL MAGAZINELE TASTE OF ASIA Vezi locațiile și programul tuturor magazinelor VEZI MAGAZINELE Livrare 24 - 48h ⦾ (+40) 724 584 948 | L-V: 09:00-16:30 SELECȚII VARIATE DE PRODUSE VEZI COLECȚIILE MAGAZINELE TASTE OF ASIA VEZI LOCAȚIILE Varietate mare de produse Ingrediente autentice Branduri consacrate Livrare rapidă (24 - 48h) Varietate mare de produse Ingrediente autentice Branduri consacrate Livrare rapidă (24 - 48h) NOUTĂȚI vezi toate {\"item_list_name\":\"NOUT\\u0102\\u021aI\",\"items\":[{\"item_id\":\"7773\",\"item_name\":\"B\\u0103utur\\u0103 carbogazoas\\u0103 cu lychee QDOL 330ml\",\"coupon\":\"N\\/A\",\"discount\":0,\"index\":0,\"item_brand\":\"QDOL\",\"item_category\":\"B\\u0103uturi r\\u0103coritoare, ceai, cafea, ap\\u0103 de cocos\",\"item_category2\":\"\",\"item_category3\":\"\",\"item_category4\":\"\",\"item_category5\":\"\",\"item_list_name\":\"NOUT\\u0102\\u021aI\",\"price\":13.5,\"quantity\":1},{\"item_id\":\"7772\",\"item_name\":\"B\\u0103utur\\u0103 carbogazoas\\u0103 cu lime QDOL 330ml\",\"coupon\":\"N\\/A\",\"discount\":0,\"index\":1,\"item_brand\":\"QDOL\",\"item_category\":\"B\\u0103uturi r\\u0103coritoare, ceai, cafea, ap\\u0103 de cocos\",\"item_category2\":\"\",\"item_category3\":\"\",\"item_category4\":\"\",\"item_category5\":\"\",\"item_list_name\":\"NOUT\\u0102\\u021aI\",\"price\":13.5,\"quantity\":1},{\"item_id\":\"7771\",\"item_name\":\"B\\u0103utur\\u0103 carbogazoas\\u0103 cu c\\u0103p\\u0219uni QDOL 330ml\",\"coupon\":\"N\\/A\",\"discount\":0,\"index\":2,\"item_brand\":\"QDOL\",\"item_category\":\"B\\u0103uturi r\\u0103coritoare, ceai, cafea, ap\\u0103 de cocos\",\"item_category2\":\"\",\"item_category3\":\"\",\"item_category4\":\"\",\"item_category5\":\"\",\"item_list_name\":\"NOUT\\u0102\\u021aI\",\"price\":13.5,\"quantity\":1},{\"item_id\":\"6795\",\"item_name\":\"Mango murat (Hot) SWAD 300g\",\"coupon\":\"N\\/A\",\"discount\":0,\"index\":3,\"item_brand\":\"SWAD\",\"item_category\":\"Produse uscate \\u0219i conserve\",\"item_category2\":\"Conserve \\u0219i mur\\u0103turi\",\"item_category3\":\"\",\"item_category4\":\"\",\"item_category5\":\"\",\"item_list_name\":\"NOUT\\u0102\\u021aI\",\"price\":14,\"quantity\":1},{\"item_id\":\"6794\",\"item_name\":\"Felii de mango Alphonso \\u00een sirop SWAD 450g\",\"coupon\":\"N\\/A\",\"discount\":0,\"index\":4,\"item_brand\":\"SWAD\",\"item_category\":\"Produse uscate \\u0219i conserve\",\"item_category2\":\"Conserve \\u0219i mur\\u0103turi\",\"item_category3\":\"\",\"item_category4\":\"\",\"item_category5\":\"\",\"item_list_name\":\"NOUT\\u0102\\u021aI\",\"pri"
    }
]