[
    {
        "url": "https://www.listafirme.ro/buzz-food-romania-srl-43951441/",
        "title": "BUZZ FOOD ROMANIA SRL din Floresti Str. Avram Iancu 408 G, CUI 43951441",
        "text": "BUZZ FOOD ROMANIA SRL din Floresti Str. Avram Iancu 408 G, CUI 43951441 LISTA FIRMELOR DIN ROMÂNIA Intră în cont Mergi la site-ul nou Sign in with Google Ține-mă minte Creează cont gratuit Recuperează cont Română Engleză Home Baze de Date Lista Firmelor BUZZ FOOD ROMANIA SRL Caută o firmă ROMANIA ALBA ARAD ARGES BACAU BIHOR BISTRITA NASAUD BOTOSANI BRASOV BRAILA BUCURESTI BUZAU CARAS SEVERIN CALARASI CLUJ CONSTANTA COVASNA DAMBOVITA DOLJ GALATI GIURGIU GORJ HARGHITA HUNEDOARA IALOMITA IASI ILFOV MARAMURES MEHEDINTI MURES NEAMT OLT PRAHOVA SATU MARE SALAJ SIBIU SUCEAVA TELEORMAN TIMIS TULCEA VASLUI VALCEA VRANCEA Caută Căutare avansată Intră în cont Mergi la site-ul nou Sign in with Google Ține-mă minte Creează cont gratuit Recuperează cont Caută o firmă ROMANIA ALBA ARAD ARGES BACAU BIHOR BISTRITA NASAUD BOTOSANI BRASOV BRAILA BUCURESTI BUZAU CARAS SEVERIN CALARASI CLUJ CONSTANTA COVASNA DAMBOVITA DOLJ GALATI GIURGIU GORJ HARGHITA HUNEDOARA IALOMITA IASI ILFOV MARAMURES MEHEDINTI MURES NEAMT OLT PRAHOVA SATU MARE SALAJ SIBIU SUCEAVA TELEORMAN TIMIS TULCEA VASLUI VALCEA VRANCEA Caută BUZZ FOOD ROMANIA SRL Prima oară pe site? Fă-ți cont gratuit sau Accesează cu SMS Firma Date de identificare Mărci înregistrate Descriere firmă Prezentări video Contact Localizare pe hartă Domeniu de activitate Informații financiare Informaţii statistice Denumiri anterioare Stare ANAF Istoric stări Istoric administratori Istoric asociati Puncte de lucru Licitații SEAP Datorii la buget Buletinul Insolvenţei MOF Dosare BPI ANAF Mai mult Mărci înregistrate Dosar ReCom Firme similare Firme conectate Detalii de identificare BUZZ FOOD ROMANIA SRL Nume firmă BUZZ FOOD ROMANIA SRL Cod Unic de Înregistrare 43951441 Nr. Înmatriculare J12/1416/2021 EUID ROONRC.J12/1416/2021 Data înfiinţării 2021. . Mărci înregistrate la OSIM Nu este cazul. Descrierea firmei BUZZ FOOD ROMANIA SRL Informaţiile de contact (email, telefon, mobil, adresa) ale firmei Buzz Food Romania precum şi informaţiile detaliate (bilanţ, dosare, mărci, etc) sunt accesibile după autentificare . Pentru a contacta firma Buzz Food Romania sau alte companii incluse în catalog vă rugam să vă autentificaţi cu contul dumneavoastră. Unele facilităti sunt disponibile în functie de pachetul de acces ales. Sediu BUZZ FOOD ROMANIA SRL - informaţii de contact. Judeţ Cluj Localitate/Sector Sat Floresti Adresă Str. Avram Iancu 408 G Et. 5 Ap. 42 Cod 407280 Telefon - Mobil - Email - Persoane din conducere: Admin. Administratori Asoc. Asociați Benef. Beneficiari Do - - Admin. Administratori Do - - Adresă web - Localizare pe hartă Domeniul de activitate preponderent (raportat în bilanț) Cod CAEN 1089 Rev. 2 (similar 1089 Rev. 3) Obiect Activitate Fabricarea altor produse alimentare n.c.a. Descriere Activitate Aceasta clasa includ - - Domenii de activitate principale (conform certificatului de înmatriculare) Cod CAEN 10 - - (similar 10 - - Rev. 3) Obiect Activitate Fabri - - Cifra Afaceri Profit Net Datorii Active Imobilizate Active"
    },
    {
        "url": "https://www.romanian-companies.eu/buzz-food-romania-srl-43951441/",
        "title": "Company BUZZ FOOD ROMANIA SRL tax code 43951441 from Romania",
        "text": "Company BUZZ FOOD ROMANIA SRL tax code 43951441 from Romania ROMANIAN COMPANIES Log in Mergi la site-ul nou Sign in with Google stay logged Create free account Account recovery Romanian English Home Databases Company List BUZZ FOOD ROMANIA SRL Search a company ROMANIA ALBA ARAD ARGES BACAU BIHOR BISTRITA NASAUD BOTOSANI BRASOV BRAILA BUCURESTI BUZAU CARAS SEVERIN CALARASI CLUJ CONSTANTA COVASNA DAMBOVITA DOLJ GALATI GIURGIU GORJ HARGHITA HUNEDOARA IALOMITA IASI ILFOV MARAMURES MEHEDINTI MURES NEAMT OLT PRAHOVA SATU MARE SALAJ SIBIU SUCEAVA TELEORMAN TIMIS TULCEA VASLUI VALCEA VRANCEA Search Advanced search Log in Mergi la site-ul nou Sign in with Google stay logged Create free account Account recovery Search a company ROMANIA ALBA ARAD ARGES BACAU BIHOR BISTRITA NASAUD BOTOSANI BRASOV BRAILA BUCURESTI BUZAU CARAS SEVERIN CALARASI CLUJ CONSTANTA COVASNA DAMBOVITA DOLJ GALATI GIURGIU GORJ HARGHITA HUNEDOARA IALOMITA IASI ILFOV MARAMURES MEHEDINTI MURES NEAMT OLT PRAHOVA SATU MARE SALAJ SIBIU SUCEAVA TELEORMAN TIMIS TULCEA VASLUI VALCEA VRANCEA Search BUZZ FOOD ROMANIA SRL First time here? Create free account or Access by SMS Company Identification data Trademarks Company description Video presentations Contact Map localization Activity domain Financial info Statistic info Old names ANAF status Status history Administrator history Shareholder history Working points SEAP auctions State debts Insolvency O.J. Files BPI ANAF More Trademarks ReCom file Similar companies Connected companies Identification data for BUZZ FOOD ROMANIA SRL Company Name BUZZ FOOD ROMANIA SRL Fiscal Code 43951441 Registry No. J12/1416/2021 EUID ROONRC.J12/1416/2021 Date of establishment 2021. . OSIM registered Trademarks None. About BUZZ FOOD ROMANIA SRL company Contact information of Buzz Food Romania like detailed information (balance sheets, court cases, registered trademarks, etc.) are available only for registered members. In order to get in touch with Buzz Food Romania or other companies included in catalog please login with your account. The active companyes are included on the Romanian-Companies CD and new features are available according the chosen access plan . Localization of BUZZ FOOD ROMANIA SRL - contact information. County Cluj City/District Sat Floresti Address Str. Avram Iancu 408 G Et. 5 Ap. 42 Cod 407280 Phone - Mobile - Email - Management people: Admin. Administrators Shareh. Shareholders Benef. Beneficiaries Do - - Admin. Administrators Do - - Web Address - Map localization Predominant activity domain (reported on the balance sheet) NACE Code 1089 Rev. 2 (like 1089 Rev. 3) Activity Manufacture of other food products n.e.c. Activity Description This class includes: - - Mmain activity domains (according registration certificate) NACE Code 10 - - (like 10 - - Rev. 3) Activity Manuf - - Turnover Net Profit Debts Fixed Assets Current Assets Equity Ownership Employees (average no.) 2024 49 295 87 17 221 9 449 13 940 6 169 1 2023 49 352 13 303 23 765 14 172 22 945"
    },
    {
        "url": "https://termene.ro/firma/43951441--",
        "title": "Just a moment...",
        "text": "Just a moment... Enable JavaScript and cookies to continue"
    },
    {
        "url": "https://www.tripadvisor.com/Restaurant_Review-g298474-d25342614-Reviews-Buzz_Food_Spot_flora-Cluj_Napoca_Cluj_County_Northwest_Romania_Transylvania.html",
        "title": "tripadvisor.com",
        "text": "tripadvisor.com Please enable JS and disable any ad blocker"
    },
    {
        "url": "https://www.risco.ro/verifica-firma/buzz-food-romania-cui-43951441?srsltid=AfmBOoq7khCth8EvJxiis5DIEr0xxpSKKE0Z6_HOfl77hs-6G08ACDB1",
        "title": "BUZZ FOOD ROMANIA S.R.L. - CUI 43951441 - Date firma, Contacte, Telefon",
        "text": "BUZZ FOOD ROMANIA S.R.L. - CUI 43951441 - Date firma, Contacte, Telefon Cauta Firma Cauta Risco.ro Risco.ro Verifica Firma Verifica Firma BUZZ FOOD ROMANIA S.R.L. BUZZ FOOD ROMANIA S.R.L. BUZZ FOOD ROMANIA S.R.L. - CUI 43951441 Firma BUZZ FOOD ROMANIA S.R.L. avand CUI 43951441 este infiintata in anul 2021 si are sediul in JUD. CLUJ, SAT FLOREŞTI COM. FLOREŞTI, STR. AVRAM IANCU, NR.408 G. Activitatea principala a firmei este Fabricarea altor produse alimentare n.c.a., respectiv CAEN 1089. Tip Societate Societate comercială cu răspundere limitata Firma micro Adresa Jud. cluj, sat floreşti com. floreşti, str. avram iancu, nr.408 g Jud. cluj, sat floreşti com. floreşti, str. avram iancu, nr.408 g Harta CUI 43951441 Registrul Comertului J12/1416/2021 Vechime 4 ani, inregistrata din 2021 Data infiintarii 19 martie 2021 CAEN Principal 1089 CAEN An Financiar 2024 1089 EUID ROONRC.J12/1416/2021 Grup: DA - compania formeaza grup cu alte firme Vezi Grup 245.200 ron Cifra de afaceri 2024 -0.13% scadere 432 ron Profit Net 2024 -99.35% scadere 1 Angajati 2024 0.00% 0.00 0 review-uri 1 Actionar 1 actionar fizic, 0 actionari juridici Vezi Actionari In Sat Floreşti , Comuna Floreşti din Cluj mai functioneaza si firmele: WHYWORRY SRL, JUD. CLUJ, SAT FLOREŞTI COM. FLOREŞTI, STR. CETĂŢII, NR.332E, SC.1 AUTO CARO SERIA SRL, JUD. CLUJ, SAT FLOREŞTI COM. FLOREŞTI, STR. VALEA GIRBOULUI, NR.FN PRIME VUX STORE S.R.L., JUD. CLUJ, SAT FLOREŞTI COM. FLOREŞTI, STR. ŞESUL DE SUS, NR.15-17, CORP 1. AP.SPATIU COMERCIAL 2ARTER SLAD STORE S.R.L., JUD. CLUJ, SAT FLOREŞTI COM. FLOREŞTI, STR. RĂZOARE, NR.209 PRINCIPIO TECH S.R.L.. JUD. CLUJ, SAT FLOREŞTI COM. FLOREŞTI, STR. ŞESUL DE SUS, NR.211A, BL.IMOBIL BARTER BUZZ FOOD ROMANIA S.R.L. - Contacte, Telefon, Email Telefon 0 - Email 0 Email-uri - Website 0 Website-uri - Persoane 1 Persoana DO●●● CR●●● DANI●●●; Datele de contact pentru aceasta firma pot fi accesate dupa deschiderea unui cont de client. RisCo pune la dispozitia utilizatorilor mai multe abonamente de vizualizare de date de contact continand numere de telefon mobil, adrese de email, website-uri si persoane care reprezinta firma. Toate datele de contact sunt obtinute din surse oficiale, acestea fiind preluate de pe diverse site-uri ale institutiilor de stat. Orice utilizator isi poate actualiza, modifica sau sterge datele de contact pentru firma pe care o reprezinta. SellNet - Contacte Firma BUZZ FOOD ROMANIA S.R.L. - Cifra de Afaceri, Profit Net, Angajati BUZZ FOOD ROMANIA S.R.L. avand CUI 43951441 a inregistrat o cifra de afaceri de 245.200 RON in anul 2024 si un profit net de 432 RON. Societatea Buzz Food Romania S.r.l. are un numar de 1 angajati in ultimul an de activitate. Domeniul de activitate al Buzz Food Romania S.r.l. conform Registrului Comertului este \"Fabricarea altor produse alimentare n.c.a.\". Firma a inregistrat o scadere de -0.1% comparativ cu anul anterior. Compania a inregistrat o scadere a datoriilor de -28% comparativ cu anul anterior de la 118.222 RON"
    },
    {
        "url": "https://targetare.ro/43951441/buzz-food-romania-srl",
        "title": "BUZZ FOOD ROMANIA SRL din Floresti - CUI 43951441",
        "text": "BUZZ FOOD ROMANIA SRL din Floresti - CUI 43951441 Caută nume, cui, website, telefon, etc. BUZZ FOOD ROMANIA SRL Caută nume, cui, website, telefon, etc. BUZZ FOOD ROMANIA SRL Stare firmă: funcțiune Ultima actualizare a datelor: 2 nov. 2025 Risc de insolvență scăzut mediu crescut Informații generale Codul fiscal al companiei BUZZ FOOD ROMANIA SRL din Cluj este 43951441 . Descarcă baze de date cu firme CUI 43951441 Reg. Comerțului J12/1416/2021 EUID ROONRC.J12/1416/2021 Data înființării 19 martie 2021 4 ani vechime Plătitor TVA TVA la încasare Split TVA CAEN 1089 - Fabricarea altor produse alimentare n.c.a. Top firme CAEN 1089 Compania are 4 ani vechime și a fost înființată în anul 2021 . Date de contact GDPR Telefon - Email - Website - Pagina de contact - Retele sociale - Adresa Jud. Cluj, Sat Floresti Com. Floresti, Str. Avram Iancu, Nr.408 G, Et.5, Ap.42 Top firme din județul Cluj Top firme din Floresti Administrator GDPR D**** C**** Da****a Sediul social al firmei BUZZ FOOD ROMANIA SRL se afla în Jud. Cluj, Sat Floresti Com. Floresti, Str. Avram Iancu, Nr.408 G, Et.5, Ap.42 . Grafic evoluție companie Evoluția cifrei de afaceri, a profitului și a numărului de angajați pe ultimii 4 ani de bilanț disponibili. PIB RO reprezintă parcursul economic al României scalat la cifra de afaceri a companiei. Date financiare detaliate BUZZ FOOD ROMANIA SRL a avut o cifră de afaceri de 245,200 RON în anul 2024 , înregistrând un profit de 432 RON. 2024 2023 2022 2021 Cifră de afaceri 245,200 0 Profit 432 99 Angajați 1 0 Datorii 85,658 28 Lichidități 46,834 13 Mijloace fixe 47,000 33 Active circulante 69,341 39 Stocuri - Creanțe 22,507 69 Capitaluri proprii 30,683 54 Capital social 200 0 Conform datelor financiare din anul 2024 , riscul de insolvență calculat este unul scăzut spre mediu . Dosare în instanță Nu a fost găsită ca și parte în dosarele din România. Pagini web relevante Nu au fost găsite pagini web care ar putea avea legătură cu această companie. Evoluție companii similare Au fost găsite companii cu activitate / descriere asemănătoare cu cea a companiei BUZZ FOOD ROMANIA SRL AROBIOPHARM SRL 30 - APERITIV COMPLEX COMERCIAL SRL 28 - MONTERIA SRL - - BFN IRINA CATERING SRL 42 - BIO-MARKET HFR SRL 232 bio-market.ro D.J.K. SRL 457 - XUD 2017 SRL 71 - PIZZERIA BASILICO SRL 15 - GRAMINA PRODCOM SRL 2 - SEVEN ICE SRL 13 - Copiază SYNAPTECH SOFTWARE SRL CUI: 42046968 J26/2241/2019 contact@targetare.ro CONȚINUT Informațiile afișate în cadrul site-ului Targetare.ro au scop exclusiv informativ. SYNAPTECH SOFTWARE SRL nu oferă niciun fel de garanție și nu are nicio răspundere pentru informațiile oferite despre companiile prezente pe site. SURSA DATELOR Site-ul conține doar date cu caracter public, preluate și normalizate din următoarele surse: onrc.ro , mfinante.ro , portal.just.ro , anaf.ro , scj.ro , data.gov.ro NAVIGARE Politica Cookies Termeni și Condiții Prelucrarea Datelor (GDPR) Contactează Targetare.ro © 2025 Targetare.ro"
    },
    {
        "url": "https://www.clujeats.ro/buzz-food-spot-flora/?language=ro",
        "title": "Buzz Food Spot Flora | Livrare rapidă, ridicare personală și servire la locație – Cluj Eats",
        "text": "Buzz Food Spot Flora | Livrare rapidă, ridicare personală și servire la locație – Cluj Eats English Romanian Cart {{items_count}} Sign in Home Restaurant Buzz Food Spot Flora - Piata Flora FN Buzz Food Spot Flora ( ratings) • Fast Food, • lei Tap for hours,address, and more Enter your address We'll confirm that you can have this restaurant delivered. Add Address You're out of range This restaurant cannot deliver to {{address_component.address1}} {{address_component.formatted_address}} Change address × Special Instructions If sold out {{sold_label}} {{ item_qty }} View order {{merchant_data.restaurant_name}} {{item_in_cart}} Few words about Buzz Food Spot Flora Read More Gallery Address: Contact# : +0740227790 Piata Flora FN Tax number : RO40185234 Get direction Opening hours: Monday 11:00 - 15:00 Tuesday 11:00 - 15:00 Wednesday 11:00 - 15:00 Thursday 11:00 - 15:00 Friday 11:00 - 15:00 Reviews Based on reviews 0.0 Load more Are you a restaurant owner? Join us and reach new customers Just a few steps to join our family Join Subscribe Colaborează cu noi Devino partener cu restaurantul Devino livrator FAQ: Restaurante și Curieri Q&A Curieri Prelucrarea datelor cu caracter personal Ajutor și Suport Contact us Urmărește-ne Facebook Instagram Informații Legale și Politici Termeni și Condiții de Utilizare Politica de utilizare cookie-uri și tehnologii similare Condiţii generale privind furnizarea serviciilor poştale PROTECTIA CONSUMATORILOR – A.N.P.C."
    },
    {
        "url": "https://www.listafirme.ro/buzz-food-spot-srl-40185234/",
        "title": "BUZZ FOOD SPOT SRL din Cluj Napoca Str. Ploiesti 47-49, CUI 40185234",
        "text": "BUZZ FOOD SPOT SRL din Cluj Napoca Str. Ploiesti 47-49, CUI 40185234 LISTA FIRMELOR DIN ROMÂNIA Intră în cont Mergi la site-ul nou Sign in with Google Ține-mă minte Creează cont gratuit Recuperează cont Română Engleză Home Baze de Date Lista Firmelor BUZZ FOOD SPOT SRL Caută o firmă ROMANIA ALBA ARAD ARGES BACAU BIHOR BISTRITA NASAUD BOTOSANI BRASOV BRAILA BUCURESTI BUZAU CARAS SEVERIN CALARASI CLUJ CONSTANTA COVASNA DAMBOVITA DOLJ GALATI GIURGIU GORJ HARGHITA HUNEDOARA IALOMITA IASI ILFOV MARAMURES MEHEDINTI MURES NEAMT OLT PRAHOVA SATU MARE SALAJ SIBIU SUCEAVA TELEORMAN TIMIS TULCEA VASLUI VALCEA VRANCEA Caută Căutare avansată Intră în cont Mergi la site-ul nou Sign in with Google Ține-mă minte Creează cont gratuit Recuperează cont Caută o firmă ROMANIA ALBA ARAD ARGES BACAU BIHOR BISTRITA NASAUD BOTOSANI BRASOV BRAILA BUCURESTI BUZAU CARAS SEVERIN CALARASI CLUJ CONSTANTA COVASNA DAMBOVITA DOLJ GALATI GIURGIU GORJ HARGHITA HUNEDOARA IALOMITA IASI ILFOV MARAMURES MEHEDINTI MURES NEAMT OLT PRAHOVA SATU MARE SALAJ SIBIU SUCEAVA TELEORMAN TIMIS TULCEA VASLUI VALCEA VRANCEA Caută BUZZ FOOD SPOT SRL Prima oară pe site? Fă-ți cont gratuit sau Accesează cu SMS Firma Date de identificare Mărci înregistrate Descriere firmă Prezentări video Contact Localizare pe hartă Domeniu de activitate Informații financiare Informaţii statistice Denumiri anterioare Stare ANAF Istoric stări Istoric administratori Istoric asociati Puncte de lucru Licitații SEAP Datorii la buget Buletinul Insolvenţei MOF Dosare BPI ANAF Mai mult Mărci înregistrate Dosar ReCom Firme similare Firme conectate Detalii de identificare BUZZ FOOD SPOT SRL Nume firmă BUZZ FOOD SPOT SRL Cod Unic de Înregistrare 40185234 Nr. Înmatriculare J2018005167127 EUID ROONRC.J2018005167127 Data înfiinţării 2018. . Mărci înregistrate la OSIM Nu este cazul. Descrierea firmei BUZZ FOOD SPOT SRL Informaţiile de contact (email, telefon, mobil, adresa) ale firmei Buzz Food Spot precum şi informaţiile detaliate (bilanţ, dosare, mărci, etc) sunt accesibile după autentificare . Pentru a contacta firma Buzz Food Spot sau alte companii incluse în catalog vă rugam să vă autentificaţi cu contul dumneavoastră. Unele facilităti sunt disponibile în functie de pachetul de acces ales. Sediu BUZZ FOOD SPOT SRL - informaţii de contact. Judeţ Cluj Localitate/Sector Loc. Cluj Napoca Adresă Str. Ploiesti 47-49 Et. 1 Ap. BIR. 3 Cod 400157 Telefon - Mobil - Email - Persoane din conducere: Admin. Administratori Asoc. Asociați Benef. Beneficiari So - - Admin. Administratori So - - Adresă web - Localizare pe hartă Domeniul de activitate preponderent (raportat în bilanț) Cod CAEN 5610 Rev. 2 (similar 5611,5612 Rev. 3) Obiect Activitate Restaurante Descriere Activitate Aceasta clasa includ - - Domenii de activitate principale (conform certificatului de înmatriculare) Cod CAEN 56 - - (similar 56 - - Rev. 2) Obiect Activitate Resta - - Cifra Afaceri Profit Net Datorii Active Imobilizate Active Circulante Capitaluri Proprii Angajați (nr. m"
    },
    {
        "url": "https://www.infoquick.ro/verificare-firme/buzz-food-spot-s-r-l-40185234",
        "title": "BUZZ FOOD SPOT S.R.L. » din CLUJ-NAPOCA » CUI 40185234 | Coface Infoquick",
        "text": "BUZZ FOOD SPOT S.R.L. » din CLUJ-NAPOCA » CUI 40185234 | Coface Infoquick Va rugam sa va asigurati ca JavaScript este activat in setarile browser-ului dumneavoastra! Unele functionalitati ale site-ului nu sunt disponibile fara JavaScript. Pentru a va bucura de o mai buna experienta pe site, va rugam sa folositi Chrome, Firefox sau Edge. Cumpara InfoQuick si primesti toate datele de care ai nevoie BUZZ FOOD SPOT S.R.L. Date identificare Detalii contact Stare firma Date financiare Pozitia in top Localizare Alte firme similare Date identificare BUZZ FOOD SPOT S.R.L. Nume firma BUZZ FOOD SPOT S.R.L. Cod unic de inregistrare (CUI) 40185234 EUID ROONRC.J2018005167127 Nr. inregistrare J2018005167127 Cod CAEN 5611 Domeniu de activitate Restaurante Data inmatricularii Vechime firma Capital Social Forma Juridica Date contact BUZZ FOOD SPOT S.R.L. Adresa JUD. CLUJ, MUN. CLUJ-NAPOCA, STR. PLOIESTI, NR.47-49, BIROU 3, ET.1 Judet CLUJ Localitate CLUJ-NAPOCA Stare firma BUZZ FOOD SPOT S.R.L. Stare firma functiune Nr. mediu angajati 1 Stare ANAF Activ Platitor TVA TVA la incasare Split TVA Vrei date complete despre aceasta firma? Creeaza Cont Fa-ti ACUM cont si primesti GRATUIT un Raport SMART despre firma ta, despre un furnizor sau despre orice partener de afaceri. In doar cativa pasi simpli, afli daca firma cautata de tine are vreun risc ce ti-ar putea afecta business-ul. Fii SMART, asigura-te ca nu ai parteneri cu incidente de plata. Vizualizeaza Rapoarte Demo Raport LIGHT Raport SMART Sectiuni RECOM Date financiare BUZZ FOOD SPOT S.R.L. An Cifra de afaceri Total active Capitaluri proprii Total datorii Total venituri Total cheltuieli Numar angajati Profit / pierdere neta Creante 2020 500 821 171 394 153 992 17 402 509 146 380 710 4 124 093 485 2021 682 679 266 527 136 214 130 313 682 679 540 198 4 135 974 8 060 2022 375 218 109 697 4 832 104 865 395 445 387 257 2 4 518 18 750 2023 361 397 99 726 31 024 68 702 361 397 331 591 1 26 191 14 569 2024 253 851 71 731 -28 291 100 022 253 851 295 550 1 -49 315 6 604 * Valorile sunt in RON × Pozitie in top BUZZ FOOD SPOT S.R.L. Locul 8991 din 14810 companii active, dupa cifra de afaceri in domeniul 5611 - Restaurante . Locul 9213 dupa venituri totate la nivel national, din sectorul firmei curente. Local 12177 in topul profitabilitati nete, la nivel national, comparativ cu firmele din acelasi domeniu de activitate. Local 8826 in topul celor mai mari angajatori din acelasi domeniu de activitate. Localizare BUZZ FOOD SPOT S.R.L. Alte firme similare Cod Fiscal Denumire Companie Localitate 41757180 PIZZERIA DOUGH S.R.L. JUCU 18106501 CRAMA CETATE SRL TURDA 232400 COM BRAS VALAHIA IMPORT EXPORT S.R.L. CLUJ-NAPOCA 217493 COLOCVII EDITURA SRL CLUJ-NAPOCA 44557284 YAURIS REDESTET IMOBILIARE S.R.L. MĂRIŞEL 3553730 LIVIROD IMPORT EXPORT SRL TURENI Abonamente Planor Afla mai multe Avion Afla mai multe Racheta Afla mai multe"
    }
]