[
    {
        "url": "https://www.romanian-companies.eu/doctor-food-srl-27998469/",
        "title": "Company DOCTOR FOOD SRL tax code 27998469 from Romania",
        "text": "Company DOCTOR FOOD SRL tax code 27998469 from Romania ROMANIAN COMPANIES Log in Mergi la site-ul nou Sign in with Google stay logged Create free account Account recovery Romanian English Home Databases Company List DOCTOR FOOD SRL Search a company ROMANIA ALBA ARAD ARGES BACAU BIHOR BISTRITA NASAUD BOTOSANI BRASOV BRAILA BUCURESTI BUZAU CARAS SEVERIN CALARASI CLUJ CONSTANTA COVASNA DAMBOVITA DOLJ GALATI GIURGIU GORJ HARGHITA HUNEDOARA IALOMITA IASI ILFOV MARAMURES MEHEDINTI MURES NEAMT OLT PRAHOVA SATU MARE SALAJ SIBIU SUCEAVA TELEORMAN TIMIS TULCEA VASLUI VALCEA VRANCEA Search Advanced search Log in Mergi la site-ul nou Sign in with Google stay logged Create free account Account recovery Search a company ROMANIA ALBA ARAD ARGES BACAU BIHOR BISTRITA NASAUD BOTOSANI BRASOV BRAILA BUCURESTI BUZAU CARAS SEVERIN CALARASI CLUJ CONSTANTA COVASNA DAMBOVITA DOLJ GALATI GIURGIU GORJ HARGHITA HUNEDOARA IALOMITA IASI ILFOV MARAMURES MEHEDINTI MURES NEAMT OLT PRAHOVA SATU MARE SALAJ SIBIU SUCEAVA TELEORMAN TIMIS TULCEA VASLUI VALCEA VRANCEA Search DOCTOR FOOD SRL First time here? Create free account or Access by SMS Were you employed by the Doctor Food? Find out how to get a Work Attestation ! Company Identification data Trademarks Company description Video presentations Contact Map localization Activity domain Financial info Statistic info Old names ANAF status Status history Administrator history Shareholder history Working points SEAP auctions State debts Insolvency O.J. Files BPI ANAF More Trademarks ReCom file Similar companies Connected companies Identification data for DOCTOR FOOD SRL Company Name DOCTOR FOOD SRL Fiscal Code 27998469 Registry No. J12/206/2011 EUID ROONRC.J12/206/2011 Date of establishment 2011. . OSIM registered Trademarks None. About DOCTOR FOOD SRL company Contact information of Doctor Food like detailed information (balance sheets, court cases, registered trademarks, etc.) are available only for registered members. In order to get in touch with Doctor Food or other companies included in catalog please login with your account. The active companyes are included on the Romanian-Companies CD and new features are available according the chosen access plan . Localization of DOCTOR FOOD SRL - contact information. County Cluj City/District Loc. Cluj Napoca Address Str. Dimitrie Gusti 9 Et. P SP. COM. Phone - Mobile 0743-384.3 - - Email - Management people: Admin. Administrators Shareh. Shareholders Benef. Beneficiaries Web Address - Map localization Predominant activity domain (reported on the balance sheet) NACE Code 4711 Rev. 2 (like 4711,4791 Rev. 3) Activity Retail sale in non-specialised stores with food, beverages or tobacco predominating Activity Description This class includes: - - Mmain activity domains (according registration certificate) NACE Code 47 - - (like 47 - - Rev. 3) Activity Retai - - Turnover Net Profit Debts Fixed Assets Current Assets Equity Ownership Employees (average no.) 2013 318 941 -4 542 103 344 9 142 78 717 "
    },
    {
        "url": "https://www.listafirme.ro/dr-food-international-srl-44568062/",
        "title": "DR S FOOD INTERNATIONAL SRL din Pietraria Fdc. Traian Vuia 4, CUI 44568062",
        "text": "DR S FOOD INTERNATIONAL SRL din Pietraria Fdc. Traian Vuia 4, CUI 44568062 LISTA FIRMELOR DIN ROMÂNIA Intră în cont Mergi la site-ul nou Sign in with Google Ține-mă minte Creează cont gratuit Recuperează cont Română Engleză Home Baze de Date Lista Firmelor DR S FOOD INTERNATIONAL SRL Caută o firmă ROMANIA ALBA ARAD ARGES BACAU BIHOR BISTRITA NASAUD BOTOSANI BRASOV BRAILA BUCURESTI BUZAU CARAS SEVERIN CALARASI CLUJ CONSTANTA COVASNA DAMBOVITA DOLJ GALATI GIURGIU GORJ HARGHITA HUNEDOARA IALOMITA IASI ILFOV MARAMURES MEHEDINTI MURES NEAMT OLT PRAHOVA SATU MARE SALAJ SIBIU SUCEAVA TELEORMAN TIMIS TULCEA VASLUI VALCEA VRANCEA Caută Căutare avansată Intră în cont Mergi la site-ul nou Sign in with Google Ține-mă minte Creează cont gratuit Recuperează cont Caută o firmă ROMANIA ALBA ARAD ARGES BACAU BIHOR BISTRITA NASAUD BOTOSANI BRASOV BRAILA BUCURESTI BUZAU CARAS SEVERIN CALARASI CLUJ CONSTANTA COVASNA DAMBOVITA DOLJ GALATI GIURGIU GORJ HARGHITA HUNEDOARA IALOMITA IASI ILFOV MARAMURES MEHEDINTI MURES NEAMT OLT PRAHOVA SATU MARE SALAJ SIBIU SUCEAVA TELEORMAN TIMIS TULCEA VASLUI VALCEA VRANCEA Caută DR S FOOD INTERNATIONAL SRL Prima oară pe site? Fă-ți cont gratuit sau Accesează cu SMS Firma Date de identificare Mărci înregistrate Descriere firmă Prezentări video Contact Localizare pe hartă Domeniu de activitate Informații financiare Informaţii statistice Denumiri anterioare Stare ANAF Istoric stări Istoric administratori Istoric asociati Puncte de lucru Licitații SEAP Datorii la buget Buletinul Insolvenţei MOF Dosare BPI ANAF Mai mult Mărci înregistrate Dosar ReCom Firme similare Firme conectate Detalii de identificare DR S FOOD INTERNATIONAL SRL Nume firmă DR S FOOD INTERNATIONAL SRL Cod Unic de Înregistrare 44568062 Nr. Înmatriculare J22/2293/2021 EUID ROONRC.J22/2293/2021 Data înfiinţării 2021. . Mărci înregistrate la OSIM Nu este cazul. Descrierea firmei DR S FOOD INTERNATIONAL SRL Informaţiile de contact (email, telefon, mobil, adresa) ale firmei Dr S Food International precum şi informaţiile detaliate (bilanţ, dosare, mărci, etc) sunt accesibile după autentificare . Pentru a contacta firma Dr S Food International sau alte companii incluse în catalog vă rugam să vă autentificaţi cu contul dumneavoastră. Unele facilităti sunt disponibile în functie de pachetul de acces ales. Sediu DR S FOOD INTERNATIONAL SRL - informaţii de contact. Judeţ Iasi Localitate/Sector Sat Pietraria Adresă Fdc. Traian Vuia 4 Cod 707038 Telefon - Mobil 0741-261.2 - - Email - 1 șterse Persoane din conducere: Admin. Administratori Asoc. Asociați Benef. Beneficiari Ch - - Admin. Administratori Ch - - Adresă web - Domeniul de activitate preponderent (raportat în bilanț) Cod CAEN 5610 Rev. 2 (similar 5611,5612 Rev. 3) Obiect Activitate Restaurante Descriere Activitate Aceasta clasa includ - - Domenii de activitate principale (conform certificatului de înmatriculare) Cod CAEN 56 - - (similar 56 - - Rev. 3) Obiect Activitate Resta - - Cifra Afaceri Profit Net Datorii Active Imobili"
    },
    {
        "url": "https://www.mydoctorfood.ro/contact",
        "title": "Contact - My Doctor Food",
        "text": "Contact - My Doctor Food Transport gratuit, pentru comenzile mai mari de 300 lei Links Home Produse recomandate Produse noi Blog Contact Autentificare Inregistrare Telefon 00 40 (746) 350 630 Autentificare Lasa-ne un mesaj De acord cu termenii și condițiile website-ului * De acord cu politica de confidențialitate a datelor * trimite Detalii Contact Nume Firma: Veroli Farmacie SRL CUI: RO22192390 Reg Comertului: J12/3356/2007 Sediul: Turda, str. Republicii, nr. 23, jud. Cluj Punct de lucru: Cluj-Napoca, str. Pasteur, nr. 75, Cluj-Napoca Program de lucru: Luni - Vineri 8:00 - 20:00, Sambata 8:00-14:00 00 40 (746) 350 630 comenzi@mydoctorfood.ro Pinterest Facebook Youtube Ai adaugat in cos Cos cumparaturi Continua"
    },
    {
        "url": "https://bg.kompass.com/c/doctor-horeca-srl/ro1264155/",
        "title": "\n            Doctor Horeca Srl - Cluj-napoca 400680, Strada Retezat Nr. 7 Sc. ...,",
        "text": "Doctor Horeca Srl - Cluj-napoca 400680, Strada Retezat Nr. 7 Sc. ..., Companies Products / Services Search too broad × Please refine your search by (Localization + What, who? Activity, company ...) Edit search Login / Register My account English Available languages English Русский Agriculture & Food Business Services Chemicals, Pharmaceuticals & Plastics Construction Education, Training & Organisations Electrical, Electronics & Optical Energy, Environment IT, Internet, R&D Leisure & Tourism Metals, Machinery & Engineering Minerals Paper, Printing, Publishing Retail & Traders Textiles, Clothing, Leather, Watchmaking, Jewellery Transport & Logistics Agriculture & Food Importers Exporters Service providers Producer Distributor Agricultural and forestry machinery and equipment Agriculture and forestry Beverages Food Food, drink, tobacco and catering industry machinery and equipment Livestock and fish Organic products Business Services Importers Exporters Service providers Producer Distributor Financial and insurance services Hire and rental services Hygiene and cleaning Services to businesses Chemicals, Pharmaceuticals & Plastics Importers Exporters Service providers Producer Distributor Chemical base materials Chemical industry plant and equipment Chemical products Health, medical and pharmaceutical Plastic products Rubber and plastic industry plant and equipment Rubber products Construction Importers Exporters Service providers Producer Distributor Building industry Civil and marine engineering contractors Civil engineering and building machinery and equipment Furniture and linen Hardware, ironmongery, cutlery and tools Heating, ventilation, air conditioning (HVAC) and refrigeration equipment Metal constructions for the building industry Metal pipework, valves and containers Security equipment Timber, wooden products, machinery and equipment for the woodworking industry Education, Training & Organisations Importers Exporters Service providers Producer Distributor Education and training International organisations, administrations and associations Social care, personal services Electrical, Electronics & Optical Importers Exporters Service providers Producer Distributor Electrical equipment. Nuclear equipment Electronic equipment. Telecommunications equipment Measuring and testing equipment Optical, photographic and cinematographic equipment Energy, Environment Importers Exporters Service providers Producer Distributor Energy, fuel and water Environmental services, renewable energies Oil and gas industry plant and equipment IT, Internet, R&D Importers Exporters Service providers Producer Distributor Information technology (IT) and Internet Research and testing Technical offices and engineering consultancies, architects Leisure & Tourism Importers Exporters Service providers Producer Distributor Hospitality, tourism, hotel and catering industries Leisure, culture and entertainment Postal services, telecommunications, radio and television Sports and le"
    },
    {
        "url": "https://www.mcclabel.com/",
        "title": "Home - Multi-Color Corporation",
        "text": "Home - Multi-Color Corporation Return Home Open Search Input Toggle Menu Elevating emotional connections between brands and consumers Labels play a powerful role in the consumer buying process. Put our packaging passion and expertise to work for you at MCC – where every product is labeled with care. Learn More Elevating emotional connections between brands and consumers Labels play a powerful role in the consumer buying process. Put our packaging passion and expertise to work for you at MCC – where every product is labeled with care. Learn More Elevating emotional connections between brands and consumers Labels play a powerful role in the consumer buying process. Put our packaging passion and expertise to work for you at MCC – where every product is labeled with care. Learn More Elevating emotional connections between brands and consumers Labels play a powerful role in the consumer buying process. Put our packaging passion and expertise to work for you at MCC – where every product is labeled with care. Learn More Elevating emotional connections between brands and consumers Labels play a powerful role in the consumer buying process. Put our relentless passion and expertise to work for you at MCC – where every product is labeled with care. Learn More Submit Search Ready to get started? Whether we’ve worked together before or this could be our first joint venture, we’re excited to get the conversation going. Get In Touch"
    },
    {
        "url": "https://ro.linkedin.com/in/magdolna-boros-51538435/en",
        "title": "No title",
        "text": ""
    },
    {
        "url": "https://www.sig.biz/",
        "title": "Packaging systems and solutions \nfor better - for better",
        "text": "Packaging systems and solutions for better - for better Packaging systems and solutions for better SIG is a leading solutions provider of packaging for better – better for our customers, for consumers, and for the world. Our solutions With our unique portfolio of carton, bag-in-box, and spouted pouch, we work in partnership with our customers to bring food and beverage products to consumers around the world in a safe, sustainable, and affordable way. Carton Bag-in-box Spouted Pouch Technology Services Choose better Step into a more sustainable future with SIG Terra Alu-free + Full barrier – the leading solution for carbon-cutting, high-performance packaging. Choose better We’re on a journey to create packaging for better Packaging that gives more to people and the planet than it takes out. Read more about our sustainability approach Innovations SIG DomeMini Our on-the-go carton bottle offers a new drinking experience and helps reducing plastic. SIG DomeMini SIG SureFill 44 Fill bag-in-box packaging quickly and accurately with our automated, dual-lane filling solution. SIG SureFill 44 Duo Connect with us Have a question or want to connect? We’d love to hear from you. Simply fill out our contact form and we’ll get back to you shortly! Contact Stay connected. Stay ahead. Follow us on LinkedIn to get the latest insights, news, and stories that shape our industry. Be part of the conversation. LinkedIn Get latest insights right into your inbox Sign up for our monthly newsletter. Join us on our journey of packaging for better. Subscription Latest blog posts November 13, 2025 Esterilização em linha em pouches: eficiência industrial e naturalidade para o consumidor A crescente demanda dos consumidores por alimentos mais naturais, com ingredientes reconhecíveis, rótulos mais limpos e maior transparência, mudou o panorama da indústria. Read article June 24, 2025 How WWF and SIG, together with 25 other leading companies, are working to help forests thrive Together, these companies are helping conserve over 1.3 million hectares of forests and improving management across an additional 2.7 million hectares. Read article April 23, 2025 Beyond tree planting Why companies should invest in landscape programmes for impact Read article View Blog Make your work matter for better Find your career path at SIG At SIG, we believe in driving change for better. We strive to create a positive impact for the society, guided by our sustainability goals. Careers Latest press releases November 18, 2025 Zydus and SIG sign deal for novel packaging solution to launch India’s first single-serve spouted pouches for liquid cough and cold medication Zydus Lifesciences Ltd., a global innovation-driven lifesciences company, and SIG, a leading packaging solutions provider, entered into an agreement to pioneer packaging of liquid cough and cold medication in single-serve spouted pouches featuring the tethered spout solution SIG StrawCap 30 Linked and the SIG Motion Servo 3.2 filling techno"
    },
    {
        "url": "https://targetare.ro/50237853/doctor-coffee-srl",
        "title": "DOCTOR COFFEE SRL din Cluj-Napoca - CUI 50237853",
        "text": "DOCTOR COFFEE SRL din Cluj-Napoca - CUI 50237853 Caută nume, cui, website, telefon, etc. DOCTOR COFFEE SRL Caută nume, cui, website, telefon, etc. DOCTOR COFFEE SRL Stare firmă: inactiva inactivă fiscal din 17 apr. 2025 Ultima actualizare a datelor: 9 nov. 2025 Informații generale Codul unic de înregistrare (CUI) al companiei DOCTOR COFFEE SRL din Cluj este 50237853 . Descarcă baze de date cu firme CUI 50237853 Reg. Comerțului J12/2788/2024 EUID ROONRC.J12/2788/2024 Data înființării 14 iunie 2024 1 an vechime Plătitor TVA TVA la încasare Split TVA CAEN 5610 - Restaurante Top firme CAEN 5610 Compania a fost înființată în anul 2024 și are 1 an vechime . Date de contact GDPR Telefon - Email - Website - Pagina de contact - Retele sociale - Adresa Jud. Cluj, Mun. Cluj-Napoca, Str. Sarmisegetuza, Nr.17-19, Et.2, Ap.12 Top firme din județul Cluj Top firme din Cluj-Napoca Administrator GDPR L*** Si***u Ca****n, G**** Ad***n, Pe*****i I*** Sediul social al companiei DOCTOR COFFEE SRL se află la adresa: Jud. Cluj, Mun. Cluj-Napoca, Str. Sarmisegetuza, Nr.17-19, Et.2, Ap.12 . Grafic evoluție companie Nu există bilanț depus pentru această companie. Date financiare detaliate Firma nu figurează cu bilanț depus. Dosare în instanță Nu a fost găsită ca și parte în dosarele din România. Pagini web relevante Nu au fost găsite pagini web care ar putea avea legătură cu această companie. Evoluție companii similare Au fost găsite companii cu activitate / descriere asemănătoare cu cea a companiei DOCTOR COFFEE SRL O MASA CU SUFLET SRL 72 - LQVAR SRL - - TECRIANA SRL - - TASTY BRANDS SRL 85 - XTWO VENTURE SRL - - DRIVE THRU HUB SRL - - GERUTO FEST SRL 78 - MIHAIU RAUL DANIEL PFA - - PIZZADAV FOOD SRL - - BEKI FAST FOOD S.R.L.-D. - - Copiază SYNAPTECH SOFTWARE SRL CUI: 42046968 J26/2241/2019 contact@targetare.ro CONȚINUT Informațiile afișate în cadrul site-ului Targetare.ro au scop exclusiv informativ. SYNAPTECH SOFTWARE SRL nu oferă niciun fel de garanție și nu are nicio răspundere pentru informațiile oferite despre companiile prezente pe site. SURSA DATELOR Site-ul conține doar date cu caracter public, preluate și normalizate din următoarele surse: onrc.ro , mfinante.ro , portal.just.ro , anaf.ro , scj.ro , data.gov.ro NAVIGARE Politica Cookies Termeni și Condiții Prelucrarea Datelor (GDPR) Contactează Targetare.ro © 2025 Targetare.ro"
    },
    {
        "url": "https://www.aspentech.com/en/",
        "title": "AspenTech | Asset Optimization Software - Asset Performance Management, Process Engineering for Chemicals, Energy and Engineering & Construction",
        "text": "AspenTech | Asset Optimization Software - Asset Performance Management, Process Engineering for Chemicals, Energy and Engineering & Construction Register Now Search Contact Us Language Close English Japanese Chinese Accelerate Performance Improvements: Monitor Key Metrics, Visualize Your Data with a Powerful Data Historian Learn More Transform your operations with innovative technologies and actionable strategies at OPTIMIZE™ 26. Connect with global industry leaders, explore cutting-edge demos and see why this is the can't-miss event of the year. Secure your spot today! Register Now Accelerating your digital transformation by optimizing assets to run safer, greener, longer and faster. Achieve Operational Excellence Ensure safe and agile operations for organizational success Learn More Innovate for Sustainability Balance resource demands with a healthy planet Learn More Empower the Workforce Work smarter, not harder with our Industrial AI solutions Learn More Our Customers 1 of Sardeolica Digitalizes Wind Farm Maintenance - Reducing Costs, Improving Uptime and Transforming Culture View the Case Study Read Success Stories from Your Industry Our Industries Bulk Chemicals Learn More Downstream Learn More Engineering, Procurement & Construction Learn More Metals & Mining Learn More Pharmaceuticals Learn More Power Generation, Transmission & Distribution Learn More Specialty Chemicals Learn More Upstream Learn More See All Industries LEARN MORE Video Together We Build the Utility of the Future Learn More White Paper Decarbonization Investment: Opportunities and Implications for EPCs Learn More White Paper Proactive Decision-Making for Emissions Management: The Roadmap to Net Zero Learn More Resource Center Ready to Talk? Give us a few details and we will quickly respond. You can also email us at info@aspentech.com . Contact Us"
    },
    {
        "url": "https://www.researchgate.net/profile/Daniela_Popescu2/2",
        "title": "ResearchGate - Temporarily Unavailable",
        "text": "ResearchGate - Temporarily Unavailable Connection issue We're experiencing a technical problem connecting to this page. Please try again later. Access denied You do not have access to www.researchgate.net. The site owner may have set restrictions that prevent you from accessing the site. Ray ID: 9a117704b8b9f9bb Timestamp: 2025-11-19 17:35:35 UTC Your IP address: 81.161.249.102 Requested URL: www.researchgate.net/profile/Daniela_Popescu2/2 Error reference number: 1020 Server ID: FL_74F141 User-Agent: Mozilla/5.0 Ray ID: 9a117704b8b9f9bb Client IP: 81.161.249.102 © ResearchGate GmbH. All rights reserved."
    }
]