[
    {
        "url": "https://www.solocheck.ie/Irish-Company/Fake-Food-Limited-503249",
        "title": "Fake Food Ltd | Irish Retail Company & Director Check",
        "text": "Fake Food Ltd | Irish Retail Company & Director Check Login Join 0 items Added to your basket No Items in your basket! 0 Items in your basket Checkout Fake Food Limited Updated: 11 hours ago 119 Views Add My Company Details Tweet Share Facebook LinkedIn Email Vitals Directors Judgments Documents Summary Fake Food Limited was set up on Monday the 5th of September 2011. Their current partial address is Dublin, and the company status is Dissolved with the company closing on Wednesday the 29th of June 2016. The company's current directors have been the director of 5 other Irish companies between them; 2 of which are now closed. Fake Food Limited has 2 shareholders. This Irish company shares its Eircode with at least 1 other company. Company Vitals Company Name: Fake Food Limited Time in Business: 4 Years Company Number: 503249 Current Status: DISSOLVED Principal Activity: [52.63] Other Non-Store Retail Sale May Trade As: Fake Food Ltd Add My Company Details Registered Address: 42 Coolmine Boulevard , Blanchardstown , Dublin 15, Dublin D15 A9XV Standard Report Full Company Vitals, including Directors & Mortgages View a sample report €3 Directors Purchase either the Standard Company Report or a Credit Report to view details on the directors of this company. Documents Document Pages Effective Received Buy B1 ANNUAL RETURN 8 05/03/2014 06/03/2014 Account details 2 05/03/2014 06/03/2014 Account details 2 05/03/2013 14/03/2013 B1 ANNUAL RETURN 8 05/03/2013 14/03/2013 B2 CHANGE IN SITUATION OF REG OFFICE. 3 28/05/2012 30/05/2012 Migrated Certificate 2 05/09/2011 22/08/2011 COMPANY CONSTITUTION 14 05/09/2011 22/08/2011 This company has 3 other documents » Ratings and Reviews Be the first to review this company! Your Rating: Click on the stars below to rate this company 1 2 3 4 5 Enter your email Company Interaction Please select Bought From Company Supplied To Company Your First Name: Your Location: Press submit below to record your opinion, first name and county. Quick, Reliable and Confidential Company Reports, Credit Ratings and Judgment Searches. WHY GET A REPORT? Make more informed decisions Protect against bad debt Make sure your deposit is safe Reduce invoice payment times Check your competitors SEARCH Location Ireland UK Intl Companies Directors Search Companies Search Directors Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia, Plurinational State of Bosnia and Herzegovina Botswana Brazil Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Colombia Comoros Congo Congo, the Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czech Republic Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Erit"
    },
    {
        "url": "https://www.fakefoodworkshop.com/",
        "title": "\n      The Fake Food Workshop & Store | Artificial Foods & Fake Food Props\n",
        "text": "The Fake Food Workshop & Store | Artificial Foods & Fake Food Props Skip to content Log in Country/region United Kingdom | GBP £ Search Albania ALL L Andorra EUR € Armenia AMD դր. Australia AUD $ Austria EUR € Azerbaijan AZN ₼ Belarus GBP £ Belgium EUR € Bosnia & Herzegovina BAM КМ Bulgaria BGN лв. Canada CAD $ Croatia EUR € Cyprus EUR € Czechia CZK Kč Denmark DKK kr. Estonia EUR € Finland EUR € France EUR € Georgia GBP £ Germany EUR € Greece EUR € Hong Kong SAR HKD $ Hungary HUF Ft Iceland ISK kr Ireland EUR € Israel ILS ₪ Italy EUR € Japan JPY ¥ Jersey GBP £ Kosovo EUR € Latvia EUR € Liechtenstein CHF CHF Lithuania EUR € Luxembourg EUR € Malaysia MYR RM Malta EUR € Moldova MDL L Monaco EUR € Montenegro EUR € Netherlands EUR € New Zealand NZD $ Norway GBP £ Poland PLN zł Portugal EUR € Romania RON Lei San Marino EUR € Singapore SGD $ Slovakia EUR € Slovenia EUR € South Korea KRW ₩ Spain EUR € Sweden SEK kr Switzerland CHF CHF Türkiye GBP £ United Arab Emirates AED د.إ United Kingdom GBP £ United States USD $ Vatican City EUR € Facebook Pinterest Instagram Country/region United Kingdom | GBP £ Search Albania ALL L Andorra EUR € Armenia AMD դր. Australia AUD $ Austria EUR € Azerbaijan AZN ₼ Belarus GBP £ Belgium EUR € Bosnia & Herzegovina BAM КМ Bulgaria BGN лв. Canada CAD $ Croatia EUR € Cyprus EUR € Czechia CZK Kč Denmark DKK kr. Estonia EUR € Finland EUR € France EUR € Georgia GBP £ Germany EUR € Greece EUR € Hong Kong SAR HKD $ Hungary HUF Ft Iceland ISK kr Ireland EUR € Israel ILS ₪ Italy EUR € Japan JPY ¥ Jersey GBP £ Kosovo EUR € Latvia EUR € Liechtenstein CHF CHF Lithuania EUR € Luxembourg EUR € Malaysia MYR RM Malta EUR € Moldova MDL L Monaco EUR € Montenegro EUR € Netherlands EUR € New Zealand NZD $ Norway GBP £ Poland PLN zł Portugal EUR € Romania RON Lei San Marino EUR € Singapore SGD $ Slovakia EUR € Slovenia EUR € South Korea KRW ₩ Spain EUR € Sweden SEK kr Switzerland CHF CHF Türkiye GBP £ United Arab Emirates AED د.إ United Kingdom GBP £ United States USD $ Vatican City EUR € Search Log in Cart Item added to your cart View cart Check out Continue shopping Extraordinary replica food Mouth-wateringly good. Shop all Dropped Ice Cream Cone Dropped Ice Cream Cone Regular price £22.00 GBP Regular price Sale price £22.00 GBP Unit price / per Melton Fauxbray Mini Pork Pie Melton Fauxbray Mini Pork Pie Regular price £18.00 GBP Regular price Sale price £18.00 GBP Unit price / per Perfect Macarons Perfect Macarons Regular price From £34.00 GBP Regular price Sale price From £34.00 GBP Unit price / per Classic Replica Croissant Sold out Classic Replica Croissant Regular price £36.00 GBP Regular price Sale price £36.00 GBP Unit price / per Sold out Barbietastic Ice Cream Cone Sold out Barbietastic Ice Cream Cone Regular price £30.00 GBP Regular price Sale price £30.00 GBP Unit price / per Sold out Freggs Sausage Roll Freggs Sausage Roll Regular price £34.00 GBP Regular price Sale price £34.00 GBP Unit price / per Mr Whippy 99 Sold out Mr Whippy "
    },
    {
        "url": "https://find-and-update.company-information.service.gov.uk/company/SC860866",
        "title": "FAKE FOOD LTD overview - Find and update company information - GOV.UK",
        "text": "FAKE FOOD LTD overview - Find and update company information - GOV.UK Cookies on Companies House services We use some essential cookies to make our services work. We'd also like to use analytics cookies so we can understand how you use our services and to make improvements. Accept analytics cookies Reject analytics cookies View cookies You've accepted analytics cookies. You can change your cookie settings at any time. Hide this message You've rejected analytics cookies. You can change your cookie settings at any time. Hide this message Cookies on Companies House services We use cookies to make our services work and collect analytics information. To accept or reject analytics cookies, turn on JavaScript in your browser settings and reload this page. Skip to main content GOV.UK Find and update company information Companies House does not verify the accuracy of the information filed (link opens a new window) Sign in / Register Search for a company or officer Search Please press ENTER to search Advanced company search Link opens in new window FAKE FOOD LTD Company number SC860866 Follow this company File for this company Company Overview for FAKE FOOD LTD (SC860866) Filing history for FAKE FOOD LTD (SC860866) People for FAKE FOOD LTD (SC860866) More for FAKE FOOD LTD (SC860866) Registered office address Riverside Mill, Beaconsfield Place, Kirkcudbright, Dumfries And Galloway, Scotland, DG6 4DP Company status Active Company type Private limited Company Incorporated on 29 August 2025 Accounts First accounts made up to 31 August 2026 due by 29 May 2027 Confirmation statement First statement date 28 August 2026 due by 11 September 2026 Nature of business (SIC) 32990 - Other manufacturing not elsewhere classified Tell us what you think of this service (link opens a new window) Is there anything wrong with this page? (link opens a new window)"
    },
    {
        "url": "https://www.reddit.com/r/ireland/comments/12fx2an/anybody_ever_experience_these_fake_restaurants_on/",
        "title": "Reddit - The heart of the internet",
        "text": "Reddit - The heart of the internet Skip to main content Go to ireland r/ireland r/ireland Can we not just keep Miggledy? Céad míle fáilte! An all-island subreddit for discussion of Irish news, politics, culture, history and society. Members • BigDickBaller93 Português (Brasil) Русский 简体中文 Italiano Bahasa Melayu Magyar Español (España) Deutsch Nederlands Norsk (Bokmål) Anybody ever experience these fake restaurants on Just eat yet? Have you gotten your money back Moaning Michael Ordered off some new pop up restaurant in Naas called tender hooks, they have their own Instagram page looks legit, anyways Misses and myself ordered it. Delivery Driver rocks up and asks \"Who ordered Eddie Rockets?\" I answered not us and asked to see address, he has the right name and address and a Big Eddie rockets sign on his ticket, food was as expected for Eddie rockets but if i wanted Eddie rockets id have ordered Eddie rockets. After ordering i checked address and contact information of the restaurant on Just Eat and they all send me to the local Eddie rockets? Anybody ever experience this? Did you ever get money back? Edit, I see a lot of people mentioning Papa John's and Supermacs, as a Galway native having moved to the big smoke when I was 18, not once did I ever think Papa John's was its own restaurant, they very clearly tell you every time they are part supermacs, The point of the post is Eddie Rockets are making restaurants on just eat, they create instagrams for them and websites where there affiliation with eddie rockets is hidden, I ordered a crisp chicken sandwich from tender hooks and they sent me a cheese please from Eddie rockets, it had the Eddie rockets wrapping paper and box, your essentially ordering the same things just described different, its like me saying heres some ham and butter as opposed to me saying here is some pigs meat with essence of cow creamer lotion and it's absolute scumbaggery. Papa John's have logos and their own branding in Supermacs, it's obvious it's a real restaurant/partnership Read more Archived post. New comments cannot be posted and votes cannot be cast. Share New to Reddit? Create your account and connect with a world of communities. Continue with Email By continuing, you agree to our User Agreement and acknowledge that you understand the Privacy Policy . Can we not just keep Miggledy? Public Anyone can view, post, and comment to this community 0 0 Top Posts Reddit reReddit: Top posts of April 8, 2023 Reddit reReddit: Top posts of April 2023 Reddit reReddit: Top posts of 2023 Reddit Rules Privacy Policy User Agreement Accessibility Reddit, Inc. © 2025. All rights reserved. Expand Navigation Collapse Navigation"
    },
    {
        "url": "https://www.rte.ie/news/2025/0611/1517748-counterfeit-food-eu-report/",
        "title": "€90m in counterfeit food, drink seized in EU last year",
        "text": "€90m in counterfeit food, drink seized in EU last year skip to main content Your browser does not support Javascript. Please turn Javascript on to get the best experience from rte.ie Weather See all results €90m in counterfeit food, drink seized in EU last year Updated / Wednesday, 11 Jun 2025 20:23 Counterfeiters frequently print fake labels to place on empty bottles (Pic: Alliance Against Counterfeit Spirits) Aengus Cox By Aengus Cox Agriculture and Consumer Affairs Correspondent Over €90 million in counterfeit food and drink products were seized across the European Union last year, according to the EU's Intellectual Property Office (EUIPO). Counterfeit products are often associated with luxury goods but food products are the second most seized category of products at the EU's external borders. Over 3,600 EU food and drink products are protected by geographical indications (GIs), which protect the names of products that originate from specific regions and possess qualities or characteristics due to that geographical environment. For example, Irish whiskey is a protected product name, meaning whiskey produced outside Ireland cannot legally be labelled as Irish whiskey. Other protected Irish brands include Achill Island Sea Salt, Sneem Black Pudding, Irish Grass Fed Beef, and the Waterford Blaa. We need your consent to load this rte-player content We use rte-player to manage extra content that can set cookies on your device and collect data about your activity. Please review their details and accept them to load the content. Manage Preferences EUIPO said that wines and spirits face one of the highest counterfeiting rates compared to other products, with annual losses in sales of €2.28 billion and nearly 5,700 jobs in the EU across all categories. For Irish products, €40 million in sales are lost each year in this sector. Last year's €90 million worth of seizures of counterfeit food and drink products were coordinated by Europol and Interpol, and amounted to 22,000 tonnes of food and around 850,000 litres of (mostly alcoholic) drinks. Counterfeiters frequently reuse original bottles (Pic: Europol and National Tax and Customs Admin Hungary) EUIPO said that counterfeit food and drink products are a 'major public health concern' (Pic: AACS) EUIPO said the operation resulted in 11 criminal networks being dismantled and 278 people reported to judicial authorities in connection with the counterfeits. According to the report, France, Italy and Germany lead in both production and consumption of geographically protected products, with France alone accounting for nearly 32% of EU GI product sales. Wine constitutes 54% of the total EU GI consumption, which makes it particularly vulnerable to counterfeiting. Other products heavily impacted by counterfeiting include olive oil, beer, meat, cheese, and dairy products. The EU agency said that when counterfeiting of drinks, particularly alcoholic drinks, organised crime groups employ sophisticated methods to decei"
    },
    {
        "url": "https://pilgrimseurope.com/",
        "title": "Pilgrim's Europe",
        "text": "Pilgrim's Europe skip to main content Coming together to create better food for everyone Brands You Know and Love Together we are Pilgrim’s Europe Fridge Raiders Oakhouse Foods Richmond Rollover Hot Dogs Moy Park Chicken Denny Explore our brands Who we are Pilgrim’s Europe is a top UK and European food company, producing own label and branded fresh chicken, pork and lamb, as well as authentic chilled and frozen ready meals, snacking ranges, added value and food service products. We’re proud to partner with local farmers across our poultry, pork, lamb and beef supply chains to supply sustainable, quality food to our customers. About us Latest news Coming together to create better food for everyone Coming together to create better food for everyone Careers at Pilgrim's Europe Current Vacancies Agriculture Commited to animal welfare through integrity Sustainability Creating the opportunity of a better future Community Support Making a difference"
    },
    {
        "url": "https://fitfoodsforlife.com/",
        "title": "Fit Foods - Fit For Life",
        "text": "Fit Foods - Fit For Life Skip to navigation Skip to main content Search Search FIND STOCKISTS Menu FIND US ACROSS IRELAND & THE UK OUR PROMISE TO YOU FIT FOR LIFE At Fit Foods, we’ve got you covered. We know life is busy. That is why we are committed to finding ways to fit great, convenient , healthier food into your life. Ready Meals Gut Friendly Yogurts Protein Puddings PIZZA BASES Frozen RANGE VIEW ALL PRODUCTS MICROWAVE FRIENDLY Ready Meals Healthy eating made easy. Low calorie, macro friendly meals that will never compromise on taste! Ready in 4 minutes LEARN MORE OUR BEST SELLERS Ready Meals Yogurts Protein Puddings Frozen Pizza Bases Read more Fit Foods Bang Bang Chicken with Chinese-Style Rice Read more Fit Foods Beef & mash with Pepper Sauce Read more Fit Foods Cheeseburger Fries Load more products Loading... TESTIMONIALS Calorie counted, tasty and quick for the days if I didn't have them I'd get a take away Taste unreal 😋 and healthy which is a bonus These are the best quick fix meals of all time. Perfect for any time of day. 100% quality. As a busy mom of 3, they have been so handy for days I don't have time to cook. So nutritious Super company... make it all so much easier for us struggling to loose a few pounds and so tasty. Wishing your company onwards abs upwards success. I just want to say I love all of your meals and your soups. I work in a busy hospital in Cork and myself and the rest of the nurses think they are actually life savers. Hi I've only started eating some of your meals, I'm doing slimming world, and we can have the meals on our plan, I'm addicted to the clean chicken curry. It's just fab thanks again for the lovely meals Because they're made with good quality ingredients and actually taste good. Plus, super convenient! Healthy balanced meals that dont sacrifice flavour and taste 😋 🫶 @fitfoodsforlife_ Gorgeous bit of grub AND it’s high protein. Trea We had so many AMAZING submissions to our Win a tr POV: everyone when they come to Ireland and find o I’ll take my high protein, low fat chicken curry PROTEIN PUDDINGS NEW FOR 2024 Introducing Fit Foods' latest creation – our freshly launched Protein Puddings! 🥄 1️⃣ Vanilla Protein Pudding 2️⃣ Caramel Protein Pudding 3️⃣ Chocolate Protein Pudding Find out more HIGH PROTEIN PIZZA BASES NEW FOR 2024 Friday night pizza? 🍕 Fit Foods high protein pizza bases have 25g of protein per base 💪 Place on your favourite toppings and enjoy 🧀 🍅 Find out more OUR STORY Fit Foods was born at Dublin Meat Company, the home of Fit Foods, and dreamt up by the O Leary family who noticed changes in people’s eating habits and the desire for healthy, convenient meal offerings. The Fit Foods ethos is Fit For Life. Our range means that Fit Foods will fit into your busy life no matter what you are doing with your day. We are committed to affordable, healthy meal options with no compromise on taste or quality. The O’Leary Family LEARN MORE KEEP IN THE KNOW WITH FIT FOODS! Be the first to learn about o"
    },
    {
        "url": "https://www.florafoodgroup.com/",
        "title": "Flora Food Group | Home | The next generation of food",
        "text": "Flora Food Group | Home | The next generation of food Skip to main content Skip to footer Previous slide Next slide Carousel slide Pause slide movement Resume slide movement use left or right arrow keys to navigate the tab, Page First page Last page More pages Next page Previous page Press Enter or Space to expand or collapse and use down arrow to navigate to the tab content close menu open menu Click to read more about this recipe Includes Your webbrowser is outdated and no longer supported by Microsoft Windows. Please update to a newer browser by downloading one of these free alternatives. Reports and Policies Supplier Centre Contact Investors Login The next generation of food Search Search All Careers Press & Media Company Our Company We deliver the next generation of delicious, natural, nutritious food, that is more affordable and more sustainable than dairy equivalents. We provide consumers with compelling choice in four growing categories: butters and spreads, creams, culinary and cheeses. Flora Food Group is new, but our brands are not, with 150+ years of heritage. Company Our Brands Our History How we Lead Purpose Our Purpose Our Purpose is to be the next generation of delicious, natural, nutritious food; more affordable, more sustainable. Our iconic brands offer compelling choice. Our Purpose Nourishing food Thriving people Flourishing planet Careers Careers Join us in providing delicious food, one spread, one bake, one dish at a time! Explore jobs Who we are What we offer Prepare for your interview Investors Media Reports and Policies Supplier Centre Contact Investors Login Company The next generation of delicious food Facts & figures ~4,700 Flora Foodies worldwide 100+ Countries served by Flora Food Group 15 Manufacturing Sites Company Offering compelling choice Branded food champion Flora Food Group delivers the next generation of delicious, natural, nutritious food. Our products are more affordable and more sustainable than their dairy equivalents. We offer consumers a compelling choice in four growing categories: butters and spreads, creams, culinary and cheeses. We hold leadership positions in many of the 100 countries we operate in, with iconic brands including Flora, Becel+ProActiv, BlueBand, Country Crock, I Can’t Believe It’s Not Butter, Rama, and Violife, together with our local brands and Professional business. We have 150+ years of heritage, deep R&D expertise and a relentless commitment to delivering delicious, nutritious food. With 15 manufacturing sites across five continents. Flora Food Group is headquartered in Amsterdam (Netherlands) and employs ~4,700 people; the company reported net sales of EUR 3.1bn in 2024. About us Flourishing Planet We are proud to highlight our plastic-free paper tub, a world first for our spreads! Visit our Flourishing Planet page to find out more about our latest innovation in packaging FIND OUT MORE Our Brands Consumers all over the world know and love our products Careers Want to be a part "
    },
    {
        "url": "https://ie.linkedin.com/in/alan-fynes-%F0%9F%8C%B1-a98a731ba",
        "title": "No title",
        "text": ""
    },
    {
        "url": "https://www.acemart.com/catalogsearch/result/?q=%F0%9F%92%A5Check%20out%F0%9F%91%89%20COXMY.%E2%80%8BCOM%20order%20cocaine%20in%20Dublin%20%F0%9F%92%A5Get%20order",
        "title": "No title",
        "text": "We are sorry but you appear to be coming from a country we do not service or ship to. If you think you have reached this message in error, please feel free to reach out to our customer service at info@acemart.com. We are sorry for the inconvenience."
    }
]