[
    {
        "url": "https://www.romanian-companies.eu/hungry-people-srl-41657246/",
        "title": "Company HUNGRY PEOPLE SRL tax code 41657246 from Romania",
        "text": "Company HUNGRY PEOPLE SRL tax code 41657246 from Romania ROMANIAN COMPANIES Log in Mergi la site-ul nou Sign in with Google stay logged Create free account Account recovery Romanian English Home Databases Company List HUNGRY PEOPLE SRL Search a company ROMANIA ALBA ARAD ARGES BACAU BIHOR BISTRITA NASAUD BOTOSANI BRASOV BRAILA BUCURESTI BUZAU CARAS SEVERIN CALARASI CLUJ CONSTANTA COVASNA DAMBOVITA DOLJ GALATI GIURGIU GORJ HARGHITA HUNEDOARA IALOMITA IASI ILFOV MARAMURES MEHEDINTI MURES NEAMT OLT PRAHOVA SATU MARE SALAJ SIBIU SUCEAVA TELEORMAN TIMIS TULCEA VASLUI VALCEA VRANCEA Search Advanced search Log in Mergi la site-ul nou Sign in with Google stay logged Create free account Account recovery Search a company ROMANIA ALBA ARAD ARGES BACAU BIHOR BISTRITA NASAUD BOTOSANI BRASOV BRAILA BUCURESTI BUZAU CARAS SEVERIN CALARASI CLUJ CONSTANTA COVASNA DAMBOVITA DOLJ GALATI GIURGIU GORJ HARGHITA HUNEDOARA IALOMITA IASI ILFOV MARAMURES MEHEDINTI MURES NEAMT OLT PRAHOVA SATU MARE SALAJ SIBIU SUCEAVA TELEORMAN TIMIS TULCEA VASLUI VALCEA VRANCEA Search HUNGRY PEOPLE SRL First time here? Create free account or Access by SMS Company Identification data Trademarks Company description Video presentations Contact Map localization Activity domain Financial info Statistic info Old names ANAF status Status history Administrator history Shareholder history Working points SEAP auctions State debts Insolvency O.J. Files BPI ANAF More Trademarks ReCom file Similar companies Connected companies Identification data for HUNGRY PEOPLE SRL Company Name HUNGRY PEOPLE SRL Fiscal Code 41657246 Registry No. J12/3650/2019 EUID ROONRC.J12/3650/2019 Date of establishment 2019. . OSIM registered Trademarks None. About HUNGRY PEOPLE SRL company Contact information of Hungry People like detailed information (balance sheets, court cases, registered trademarks, etc.) are available only for registered members. In order to get in touch with Hungry People or other companies included in catalog please login with your account. The active companyes are included on the Romanian-Companies CD and new features are available according the chosen access plan . Localization of HUNGRY PEOPLE SRL - contact information. County Cluj City/District Sat Floresti Address Str. Abatorului 130 Cod 407280 Phone - Mobile - Email - Management people: Admin. Administrators Shareh. Shareholders Benef. Beneficiaries Iu - - Admin. Administrators Iu - - Web Address - Map localization Predominant activity domain (reported on the balance sheet) NACE Code 5610 Rev. 2 (like 5611,5612 Rev. 3) Activity Restaurants and mobile food service activities Activity Description This class includes - - Mmain activity domains (according registration certificate) NACE Code 56 - - (like 56 - - Rev. 3) Activity Resta - - Turnover Net Profit Debts Fixed Assets Current Assets Equity Ownership Employees (average no.) 2024 0 -3 9 184 0 -4 -9 188 0 2019 3 213 -477 30 168 22 997 6 737 -435 1 (undeclared values ​​also appear with 0) Currency RO"
    },
    {
        "url": "https://mail.infoprofit.ro/en/company/hungry-people-srl-41657246",
        "title": "HUNGRY PEOPLE SRL from Floreşti - Fiscal Code 41657246",
        "text": "HUNGRY PEOPLE SRL from Floreşti - Fiscal Code 41657246 HUNGRY PEOPLE SRL 41657246 Descending Increasing Search Company Details Company name HUNGRY PEOPLE S.R.L. Fiscal Code 41657246 VAT Payer RO41657246 from date 13.12.2019 No. Matriculation J12/3650/2019 Foundation date 18.09.2019 You have access to a multitude of information about this company by creating a free account. Create account Description Company HUNGRY PEOPLE SRL, Fiscal Code 41657246, was established on 18.09.2019 Contact Information Address ABATORULUI 130 **** ? City / Sector Floreşti County CLUJ Country Romania Company indicators (EUR) Year CAEN Business Figure Net Profit Debts Fixed Assets Current Assets Own Capitals Employees (average number) 2019 5610 3 017 -2 278 28 333 21 598 6 327 -408 1 Business figure vs Profit Own Capitals Debts Frequently Asked Questions How many employees does company HUNGRY PEOPLE S.R.L. have? In the year 2019 the company HUNGRY PEOPLE SRL had a total of 1 employees What is the turnover and profit of company HUNGRY PEOPLE S.R.L.? The turnover recorded by HUNGRY PEOPLE S.R.L. in the year 2019 was 3 017 EUR, and the net profit -2 278 EUR of which losses of 448 EUR. Is this company a VAT payer? Yes! HUNGRY PEOPLE SRL became a VAT payer on 13.12.2019, having the tax vector RO41657246. Companies with the same CAEN code Company name Fiscal Code No. Matriculation MISTER CHEF M & C SRL 30500040 J22/1274/2012 BONTON BEACH SRL 31651246 J13/1136/2013 GN FASHION INVEST S.R.L. 43426744 J40/16939/2020 KANTA JUNCTION S.R.L. 43643832 J12/434/2021 COFFEE HUB S.R.L. 48709180 J40/16196/2023 ALYKAS DONUTS S.R.L. 50253476 J23/4457/2024 Companies from the same locality Company name Fiscal Code No. Matriculation ICA TRADITIONAL S.R.L. 33663328 J12/2909/2014 MELIO FARM SRL 33471268 J12/2394/2014 MARIROBI PRO SRL 33679960 J12/2954/2014 LEGIDA PROCON S.R.L. 33683635 J12/2959/2014 CRAZY DAISY SRL 33685482 J12/2963/2014 REFLEX PEOPLE SERVICES SRL 33685512 J12/2967/2014 We use cookies This website uses cookies in order to enhance the overall user experience. Take a look at our Cookies Policy for more information. Only essentials Accept all Customize Essential cookies There are some cookies that we have to include in order for certain web pages to function. For this reason, they do not require your consent. info_profit_cookie_consent 1 year 1 month 1 day Used to store the user's cookie consent preferences. info_profit_session 2 hours Used to identify the user's browsing session. XSRF-TOKEN 2 hours Used to secure both the user and our website against cross-site request forgery attacks. More details Preferences cookies Preference cookies enable a website to remember information that changes the way the website behaves or looks, like your preferred language or the region that you are in. remember_web_ 1 month 2 days Used to store the user in order to avoid login every time. More details Statistics cookies We use these for internal research on how we can improve the service we provide f"
    },
    {
        "url": "https://termene.ro/firma/41657246-HUNGRY-PEOPLE-SRL",
        "title": "Just a moment...",
        "text": "Just a moment... Enable JavaScript and cookies to continue"
    },
    {
        "url": "https://targetare.ro/41657246/hungry-people-srl",
        "title": "HUNGRY PEOPLE SRL din Floresti - CUI 41657246",
        "text": "HUNGRY PEOPLE SRL din Floresti - CUI 41657246 Caută nume, cui, website, telefon, etc. HUNGRY PEOPLE SRL Caută nume, cui, website, telefon, etc. HUNGRY PEOPLE SRL Stare firmă: funcțiune Ultima actualizare a datelor: 11 nov. 2025 Risc de insolvență scăzut mediu crescut Informații generale Codul fiscal al firmei HUNGRY PEOPLE SRL din Cluj este 41657246 . Descarcă baze de date cu firme CUI 41657246 Reg. Comerțului J12/3650/2019 EUID ROONRC.J12/3650/2019 Data înființării 18 septembrie 2019 6 ani vechime Plătitor TVA TVA la încasare Split TVA CAEN 5610 - Restaurante Top firme CAEN 5610 Compania are 6 ani vechime și a fost înființată în anul 2019 . Date de contact GDPR Telefon - Email - Website - Pagina de contact - Retele sociale - Adresa Jud. Cluj, Sat Floresti Com. Floresti, Str. Abatorului, Nr.130 Top firme din județul Cluj Top firme din Floresti Administrator GDPR I**** Cr*****n L**** Sediul social al companiei HUNGRY PEOPLE SRL se află la adresa: Jud. Cluj, Sat Floresti Com. Floresti, Str. Abatorului, Nr.130 . Grafic evoluție companie Evoluția cifrei de afaceri, a profitului și a numărului de angajați pe ultimii 2 ani de bilanț disponibili. PIB RO reprezintă parcursul economic al României scalat la cifra de afaceri a companiei. Date financiare detaliate 2024 2019 Cifră de afaceri - Profit -13 - Angajați - Datorii 45,684 - Lichidități -73 - Mijloace fixe - Active circulante -20 - Stocuri 50 - Creanțe 3 - Capitaluri proprii -45,704 - Capital social 200 - Conform datelor financiare din anul 2024 , riscul de insolvență calculat este unul scăzut . Dosare în instanță Nu a fost găsită ca și parte în dosarele din România. Pagini web relevante Nu au fost găsite pagini web care ar putea avea legătură cu această companie. Evoluție companii similare Au fost găsite companii cu activitate / descriere asemănătoare cu cea a companiei HUNGRY PEOPLE SRL INSIGHT NIGHT AND DAY EVENTS SRL - - EXCLUSIVE PLUS SRL - - AC VISION SRL - - SATEC PROD SRL - - NOVELLI DESIGN SRL 61 chios.ro SATTVA SRL 2 dashi.ro, tokyorestaurant.ro, wasabidelivery.ro ROYAL GABRIEL ALIMENTATIE PUBLICA SRL - - MEGATIP SRL 10 - GERASE COM SRL - - MIFLOR PRODCOM SRL 96 - Companii la aceeași adresă Au fost găsite și alte companii la adresa: Jud. Cluj, Sat Floresti Com. Floresti, Str. Abatorului, Nr.130 PECUNIA ESTATE SRL 9 iunie 2011 TOR ELECTRIC SRL 19 februarie 2004 Copiază SYNAPTECH SOFTWARE SRL CUI: 42046968 J26/2241/2019 contact@targetare.ro CONȚINUT Informațiile afișate în cadrul site-ului Targetare.ro au scop exclusiv informativ. SYNAPTECH SOFTWARE SRL nu oferă niciun fel de garanție și nu are nicio răspundere pentru informațiile oferite despre companiile prezente pe site. SURSA DATELOR Site-ul conține doar date cu caracter public, preluate și normalizate din următoarele surse: onrc.ro , mfinante.ro , portal.just.ro , anaf.ro , scj.ro , data.gov.ro NAVIGARE Politica Cookies Termeni și Condiții Prelucrarea Datelor (GDPR) Contactează Targetare.ro © 2025 Targetare.ro"
    },
    {
        "url": "https://www.facebook.com/srmrecruitment/posts/-hungry-for-a-fresh-start-deliver-with-purpose-in-romania-food-delivery-jobs-ava/122154029060801073/",
        "title": "🍔 Hungry for a Fresh Start?... - SRM Recruitment Agency SRL",
        "text": "🍔 Hungry for a Fresh Start?... - SRM Recruitment Agency SRL"
    },
    {
        "url": "https://www.linkedin.com/pub/dir/Andreea/Ali?trk=public_profile_samename-see-all",
        "title": "No title",
        "text": ""
    },
    {
        "url": "https://www.listafirme.ro/smart-contacontrol-srl-41657165/",
        "title": "SMART CONTACONTROL SRL din Cluj Napoca Aleea Clabucet 4, CUI 41657165",
        "text": "SMART CONTACONTROL SRL din Cluj Napoca Aleea Clabucet 4, CUI 41657165 LISTA FIRMELOR DIN ROMÂNIA Intră în cont Mergi la site-ul nou Sign in with Google Ține-mă minte Creează cont gratuit Recuperează cont Română Engleză Home Baze de Date Lista Firmelor SMART CONTACONTROL SRL Caută o firmă ROMANIA ALBA ARAD ARGES BACAU BIHOR BISTRITA NASAUD BOTOSANI BRASOV BRAILA BUCURESTI BUZAU CARAS SEVERIN CALARASI CLUJ CONSTANTA COVASNA DAMBOVITA DOLJ GALATI GIURGIU GORJ HARGHITA HUNEDOARA IALOMITA IASI ILFOV MARAMURES MEHEDINTI MURES NEAMT OLT PRAHOVA SATU MARE SALAJ SIBIU SUCEAVA TELEORMAN TIMIS TULCEA VASLUI VALCEA VRANCEA Caută Căutare avansată Intră în cont Mergi la site-ul nou Sign in with Google Ține-mă minte Creează cont gratuit Recuperează cont Caută o firmă ROMANIA ALBA ARAD ARGES BACAU BIHOR BISTRITA NASAUD BOTOSANI BRASOV BRAILA BUCURESTI BUZAU CARAS SEVERIN CALARASI CLUJ CONSTANTA COVASNA DAMBOVITA DOLJ GALATI GIURGIU GORJ HARGHITA HUNEDOARA IALOMITA IASI ILFOV MARAMURES MEHEDINTI MURES NEAMT OLT PRAHOVA SATU MARE SALAJ SIBIU SUCEAVA TELEORMAN TIMIS TULCEA VASLUI VALCEA VRANCEA Caută SMART CONTACONTROL SRL Prima oară pe site? Fă-ți cont gratuit sau Accesează cu SMS Firma Date de identificare Mărci înregistrate Descriere firmă Prezentări video Contact Localizare pe hartă Domeniu de activitate Informații financiare Informaţii statistice Denumiri anterioare Stare ANAF Istoric stări Istoric administratori Istoric asociati Puncte de lucru Licitații SEAP Datorii la buget Buletinul Insolvenţei MOF Dosare BPI ANAF Mai mult Mărci înregistrate Dosar ReCom Firme similare Firme conectate Detalii de identificare SMART CONTACONTROL SRL Nume firmă SMART CONTACONTROL SRL Cod Unic de Înregistrare 41657165 Nr. Înmatriculare J12/3649/2019 EUID ROONRC.J12/3649/2019 Data înfiinţării 2019. . Mărci înregistrate la OSIM Nu este cazul. Descrierea firmei SMART CONTACONTROL SRL Informaţiile de contact (email, telefon, mobil, adresa) ale firmei Smart Contacontrol precum şi informaţiile detaliate (bilanţ, dosare, mărci, etc) sunt accesibile după autentificare . Pentru a contacta firma Smart Contacontrol sau alte companii incluse în catalog vă rugam să vă autentificaţi cu contul dumneavoastră. Unele facilităti sunt disponibile în functie de pachetul de acces ales. Sediu SMART CONTACONTROL SRL - informaţii de contact. Judeţ Cluj Localitate/Sector Loc. Cluj Napoca Adresă Aleea Clabucet 4 Bl. P3 Ap. 53 Cod 400549 Telefon - Mobil 0744-435.3 - - Email smar - - Persoane din conducere: Admin. Administratori Asoc. Asociați Benef. Beneficiari Ba - - Admin. Administratori Ba - - Adresă web - Localizare pe hartă Domeniul de activitate preponderent (raportat în bilanț) Cod CAEN 6920 Rev. 2 (similar 6920 Rev. 3) Obiect Activitate Activitati de contabilitate si audit financiar; consultanta in domeniul fiscal Descriere Activitate Aceasta clasa includ - - Domenii de activitate principale (conform certificatului de înmatriculare) Cod CAEN 69 - - (similar 69 - - Rev. 3) Obiect Activitate Activ -"
    },
    {
        "url": "https://wolt.com/en/rou?srsltid=AfmBOorx8PaMhvLefXAwLdqhFOLamMY7uplTGRM5dxV3ZwGbV7GuJRQV",
        "title": "Wolt Delivery | Food, Groceries and more in 30 minutes | Romania",
        "text": "Wolt Delivery | Food, Groceries and more in 30 minutes | Romania Partners Jobs When cravings hit Now Wolt delivers Tazz is now Wolt Log in for saved addresses Popular around you right now Everything you love about Tazz. Now on Wolt Everything you love about Tazz. Now on Wolt A new experience awaits you A new experience awaits you Discover Wolt The only delivery app you’ll need Finding the right food, gifts, and other items has never been easier. We’re proud to have the #1 rated delivery app across the app stores. Quick and reliable deliveries Whatever you need, delivered fast. It’s reliable, and tracked all the way – so you’ll always know where your order is and what time you’ll get it. Genius stays with you Your Genius subscription is now Wolt+. You’ll continue to enjoy free deliveries, exclusive offers, and so much more. It’s the same awesome perks, just with a fresh new name. Smart deals and big savings Whether you’re craving something or need a shopping fix, there’s always a deal waiting. Keep an eye out – you never know what surprise might pop up next! Become a courier partner Earn by delivering to local customers. Set your own schedule, deliver when and where you want. For couriers Reach new customers We help you to grow your business by helping thousands of people find your venue. For merchants Life tastes better with Wolt Almost everything delivered to you – quickly, reliably, and affordably Real support from real people Our world-class support team has your back, with friendly assistance and fast response times. 0 leu delivery fees with Wolt+ Enjoy zero delivery fees from the best restaurants and stores in your city. Unlock your Genius through Wolt+ Try 30 days for free Available Wolt Codes and Deals Check our latest offers Award winning mobile app 4.9 AppStore 4.2 Google Play For restaurants and stores For restaurants and stores Let's grow your business together Let's grow your business together Get started Boost your sales 91% of Wolt orders are extra sales you wouldn’t otherwise get. We do the heavy lifting We handle ads, payments, delivery and support. It's 100% risk-free There's no fee for joining Wolt. You can quit whenever, for any reason. When you earn, we earn. Reach new customers and get more orders For restaurants Become a store partner For stores For couriers For couriers Earn when and where you want Earn when and where you want Get started Competitive earnings The more you deliver, the more money you can earn. Get paid per delivery and for distance covered. Learn more Flexible hours Choose your own hours and set your own schedule. Plus, no delivery experience required. Learn more Become a Wolt courier partner For couriers Explore Wolt cities Select country All countries Albania Austria Azerbaijan Bulgaria Croatia Cyprus Czech Republic Denmark Estonia Finland Georgia Germany Greece Hungary Iceland Israel Japan Kazakhstan Kosovo Latvia Lithuania Luxembourg Malta North Macedonia Norway Poland Romania Serbia Slovakia Slovenia Sw"
    },
    {
        "url": "https://www.romania-insider.com/csm-deputy-pm-complaint-pensions-nov-2025",
        "title": "Romania’s Superior Council of Magistracy files criminal complaint against deputy PM over pension comments | Romania Insider",
        "text": "Romania’s Superior Council of Magistracy files criminal complaint against deputy PM over pension comments | Romania Insider Skip to main content 5°C Bucharest, RO 19:31 Search 5°C Bucharest, RO 19:31 Search SERVICES NEWSLETTER Defense Romania’s Superior Council of Magistracy files criminal complaint against deputy PM over pension comments 11 November 2025 Iulian Ernst Like this article? Share it with your friends! Facebook Twitter Google Pinterest Reddit Email LinkedIn The Superior Council of Magistracy (CSM) has filed a criminal complaint against deputy prime minister Oana Gheorghiu, accusing her of “violating the independence of justice and the status of magistrates in an irresponsible and populist manner,” the institution announced. The move follows Gheorghiu’s recent comments on Digi24 , calling for a reduction in magistrates’ special pensions, which the CSM claims amounted to incitement to hatred and violence against members of the judiciary. The council argued that her statements undermined public confidence in the justice system and represented a form of political interference in judicial independence. During the interview, Gheorghiu said that the funds used to cover special pensions, including those for magistrates, come at the expense of other public services. “The money used to pay for magistrates’ and other special pensions is taken from other sources, from children, from hospitals, and those who receive them should think about where it would be appropriate to get funds to pay their high incomes,” she said. She also criticized the system that allows magistrates to benefit from large compensation awards made through court rulings by their peers. “They get [this money] from somewhere, and they can take it from the mouth of a child who goes to bed hungry, from the budget of a hospital that has no medicines. This money is not printed and does not come out of thin air; it comes from somewhere. And maybe that’s what people don’t understand: that when you receive privileges, for you to have privileges, someone is left behind,” Gheorghiu stated. The complaint intensifies tensions between the judiciary and the Government as officials race to reform the special pensions system by November 28, a key deadline for unlocking EUR 870 million in suspended EU funds under the Resilience Facility. (Photo: George Calin/ Inquam Photos) iulian@romania-insider.com Read next 21 October 2025 Justice Romania's Constitutional Court finds procedural flaw with law aiming to reform magistrates' pension system Normal Defense Romania’s Superior Council of Magistracy files criminal complaint against deputy PM over pension comments 11 November 2025 Iulian Ernst Like this article? Share it with your friends! Facebook Twitter Google Pinterest Reddit Email LinkedIn The Superior Council of Magistracy (CSM) has filed a criminal complaint against deputy prime minister Oana Gheorghiu, accusing her of “violating the independence of justice and the status of magistrates in an i"
    },
    {
        "url": "https://www.romaniajournal.ro/society-people/one-in-ten-children-went-to-bed-hungry-in-romania-last-year/",
        "title": "Just a moment...",
        "text": "Just a moment... Enable JavaScript and cookies to continue"
    }
]