[
    {
        "url": "https://www.vision-net.ie/Company-Info/Lsc-Food-Limited-719115",
        "title": "Lsc Food Limited - Irish and UK Company Information - Vision-Net",
        "text": "Lsc Food Limited - Irish and UK Company Information - Vision-Net BLOG JOIN UP TOP-UP ABOUT LOGIN Lsc Food Limited Summary Latest Updates Credit Score Business Checks Company Summary Lsc Food Limited was set up on Friday the 13th of May 2022. Their current partial address is Dublin, and the company status is Normal. The company's current director has been the director of 1 other Irish company. Lsc Food Limited has 1 shareholder. Company Name: Lsc Food Limited Company Status: NORMAL Company Address: 51b Church Street, Skerries, Dublin, Ireland Key Executive: Ms Lau Company Size: Log-In To View Key Contact Profile Ms Lau is a Company Director of Lsc Food Limited since 2022 and a listed Director of 1 other companies. Generate a B2B Marketing List with ease and grow your business. Identify key decision makers and pre-qualified new prospects for your sales and business development teams. Similar Companies - Create a marketing list of similar companies Latest Updates The latest documents filed with the Companies Registration Office for Lsc Food Limited (which can include the Account Details) are listed below. CRO Document Effective Date Received By CRO View Now Form B1C - Annual Return General 31/03/2025 26/05/2025 Join Up FINANCIAL STATEMENT 31/03/2025 26/05/2025 Join Up Form B1B73 - Annual Return and Change of ARD 13/11/2024 04/01/2025 Join Up Form B1C - Annual Return General 13/11/2023 19/12/2023 Join Up FINANCIAL STATEMENT 13/11/2023 19/12/2023 Join Up THIS COMPANY HAS 5 OTHER DOCS » View CRO company documents and company reports any Irish company or business with ease. Credit Report View the Latest Credit Report and Credit Limit on Lsc Food Limited. Company Status: Normal Latest Credit Movement: Date of Last Movement: 03/07/2025 Latest Accounts Filed: 26/05/2025 Report Based on Accounts: 30/06/2024 Next Set of Accounts Due: 31/03/2026 Overdue: No Credit Score: Join-Up to View Full Credit Rating To View the latest Credit Rating or Credit Limit on Lsc Food Limited simply click 'Log-In' or 'Join-Up' below. Log-In Join-Up Vision-net Credit Scores save your business the time and cost of chasing slow payers. Evaluate risk at client application stage or run continuous credit checks on your full customer base. Directors & Owners Satisfy due diligence requirements on Lsc Food Limited in one single 'time-saving' search. Run full background checks for Fitness and Probity on the directors of Lsc Food Limited and Anti-Money Laundering checks (AML checks) on Lsc Food Limited Directors details are available to logged in users. Ownership Structure Company Type: LTD - Private Company Limited By Shares Number of Shareholders: 1 Compliance Log-in now to run Due Diligence checks and Compliance checks on Lsc Food Limited or click Join-up to get started. Log-In Join-up Background check Companies, Sole Traders or Individuals and minimise your spend with more efficient Anti-Money Laundering checks and reports. For the latest Liquidator, Receiver and Examiner appointments "
    },
    {
        "url": "https://www.solocheck.ie/Irish-Company/Lsc-Food-Limited-719115",
        "title": "Lsc Food Ltd - Irish Company Info and Credit Scores - SoloCheck",
        "text": "Lsc Food Ltd - Irish Company Info and Credit Scores - SoloCheck Login Join 0 items Added to your basket No Items in your basket! 0 Items in your basket Checkout Lsc Food Limited Updated: 9 hours ago 84 Views Add My Company Details Tweet Share Facebook LinkedIn Email Vitals Directors Credit Score Judgments Documents Summary Lsc Food Limited was set up on Friday the 13th of May 2022. Their current partial address is Dublin, and the company status is Normal. The company's current director has been the director of 1 other Irish company. Lsc Food Limited has 1 shareholder. Credit Score Latest Credit Movement: Date of Last Movement: 03/07/2025 Latest Accounts Filed: 26/05/2025 Report Based On Accounts: 30/06/2024 Next Set of Accounts Due: 31/03/2026 Overdue: No Credit Report Credit Report & Financials Company Printout Report Directors & Owners Report Bad Debt Judgments Report Mortgages Report View a sample report €9 Company Vitals Company Name: Lsc Food Limited Time in Business: 3 Years Company Number: 719115 Company Size: Small Company Current Status: NORMAL Principal Activity: [5610] Restaurants and Mobile Food Service Activities May Trade As: The Green Add My Company Details Registered Address: 51b Church Street , Skerries, Dublin, Ireland K34 KX20 Standard Report Full Company Vitals, including Directors & Mortgages View a sample report €3 Directors Purchase either the Standard Company Report or a Credit Report to view details on the directors of this company. Documents Document Pages Effective Received Buy Form B1C - Annual Return General 4 31/03/2025 26/05/2025 FINANCIAL STATEMENT 11 31/03/2025 26/05/2025 Form B1B73 - Annual Return and Change of ARD 4 13/11/2024 04/01/2025 FINANCIAL STATEMENT 11 13/11/2023 19/12/2023 Form B1C - Annual Return General 4 13/11/2023 19/12/2023 Certificate of Incorporation 1 13/05/2022 28/04/2022 Constitution 1 13/05/2022 28/04/2022 This company has 3 other documents » X Want More Insight? Did you know our Credit Report includes full financials for up to 5 years, credit score/limit, ratios, history and so much more to help you view the full picture? Credit Report €9 Only This Document €6 Ratings and Reviews Be the first to review this company! Your Rating: Click on the stars below to rate this company 1 2 3 4 5 Enter your email Company Interaction Please select Bought From Company Supplied To Company Your First Name: Your Location: Press submit below to record your opinion, first name and county. Quick, Reliable and Confidential Company Reports, Credit Ratings and Judgment Searches. WHY GET A REPORT? Make more informed decisions Protect against bad debt Make sure your deposit is safe Reduce invoice payment times Check your competitors SEARCH Location Ireland UK Intl Companies Directors Search Companies Search Directors Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Beni"
    },
    {
        "url": "https://www.recruitireland.com/company/lsc-food-ltd/updates",
        "title": "LSC Food Ltd Updates - Recruit Ireland",
        "text": "LSC Food Ltd Updates - Recruit Ireland Job Seekers Employers About Us Contact Us No Thanks Be first to know We’ll notify you about new and informative articles, marketing information and more. Notify Me LSC Food Ltd Dublin, Co. Dublin Jobs at LSC Food Ltd View all LSC Food Ltd jobs Find jobs in your area Jobs in Co. Antrim Jobs in Co. Armagh Jobs in Co. Carlow Jobs in Co. Cavan Jobs in Co. Clare Jobs in Co. Cork Jobs in Co. Derry Jobs in Co. Donegal Jobs in Co. Down Jobs in Co. Dublin Jobs in Co. Fermanagh Jobs in Co. Galway Jobs in Co. Kerry Jobs in Co. Kildare Jobs in Co. Kilkenny Jobs in Co. Laois Jobs in Co. Leitrim Jobs in Co. Limerick Jobs in Co. Longford Jobs in Co. Louth Jobs in Co. Mayo Jobs in Co. Meath Jobs in Co. Monaghan Jobs in Co. Offaly Jobs in Co. Roscommon Jobs in Co. Sligo Jobs in Co. Tipperary Jobs in Co. Tyrone Jobs in Co. Waterford Jobs in Co. Westmeath Jobs in Co. Wexford Jobs in Co. Wicklow"
    },
    {
        "url": "https://www.lsg-group.com/lsg-sky-chefs/",
        "title": "Your global leader in airline catering and hospitality",
        "text": "Your global leader in airline catering and hospitality LSG Group LSG Sky Chefs delivers world-class airline catering, food and services LSG Sky Chefs is best known as one of the world’s largest airline catering and hospitality company. While a recognized name in airline catering, LSG Sky Chefs also supports airlines with a wide selection of related services. These include lounge catering, hospitality, airline consulting, and last-mile logistics. Driven to create unrivalled culinary experiences for people on the go, LSG Sky Chefs offers complete airline catering programs and bespoke food solutions for every price category. These cover everything from premium onboard dining to full-tray menus, meals and snacks. American in origin, Sky Chefs was founded by American Airlines in Texas in 1942, making it the oldest independent caterer in the world. In Germany, LSG was founded by Lufthansa in 1966 as an independent company. After establishing a strong market presence for Sky Chefs across the United States and Latin America, LSG first acquired a stake in the company in 1993. Already back then, the two companies started to market their airline catering activities under the “LSG Sky Chefs” brand. In 2001, LSG fully acquired Sky Chefs. Since then, LSG Sky Chefs has continued its global expansion primarily through joint ventures and partnerships throughout Asia and Africa. Today, LSG Sky Chefs delivers over 308 million meals a year and is present at 131 locations in 49 countries. For more information about LSG Sky Chefs or our portfolio: Airline Catering Packaged Food Solutions Convenience Retail Airport Lounge Catering Aviation Security Services Work with us to delight your passengers and customers with a new level of culinary and hospitality experience. Contact us"
    },
    {
        "url": "https://www.solocheck.ie/Irish-Company/Landc-Foods-Emporium-Limited-556909",
        "title": "L&C Foods Emporium Ltd - Irish Company Info - SoloCheck",
        "text": "L&C Foods Emporium Ltd - Irish Company Info - SoloCheck Login Join 0 items Added to your basket No Items in your basket! 0 Items in your basket Checkout L&C Foods Emporium Limited Updated: 9 hours ago 140 Views Add My Company Details Tweet Share Facebook LinkedIn Email Vitals Directors Credit Score Judgments Documents Summary L&C Foods Emporium Limited was set up on Tuesday the 3rd of February 2015. Their current partial address is Dublin, and the company status is Normal. The company's current director has been the director of 0 other Irish companies. L&C Foods Emporium Limited has 1 shareholder. Credit Score Latest Credit Movement: Date of Last Movement: 13/11/2025 Latest Accounts Filed: 10/11/2025 Report Based On Accounts: 31/12/2024 Next Set of Accounts Due: 30/09/2026 Overdue: No Credit Report Credit Report & Financials Company Printout Report Directors & Owners Report Bad Debt Judgments Report Mortgages Report View a sample report €9 Company Vitals Company Name: L&C Foods Emporium Limited Time in Business: 10 Years Company Number: 556909 Company Size: Micro Company Current Status: NORMAL Principal Activity: [55.30] Restaurants May Trade As: L&C Foods Emporium Ltd Add My Company Details Registered Address: 471 South Circular Road , Dublin 8, Dublin D08 X773 Standard Report Full Company Vitals, including Directors & Mortgages View a sample report €3 Directors Purchase either the Standard Company Report or a Credit Report to view details on the directors of this company. Documents Document Pages Effective Received Buy NEW! Form B1C - Annual Return General 4 30/09/2025 10/11/2025 NEW! FINANCIAL STATEMENT 13 30/09/2025 10/11/2025 FINANCIAL STATEMENT 13 30/09/2024 29/10/2024 Form B1C - Annual Return General 4 30/09/2024 29/10/2024 Form B1C - Annual Return General 4 30/09/2023 09/10/2023 Migrated Certificate 2 03/02/2015 07/01/2015 COMPANY CONSTITUTION 26 03/02/2015 07/01/2015 This company has 21 other documents » X Want More Insight? Did you know our Credit Report includes full financials for up to 5 years, credit score/limit, ratios, history and so much more to help you view the full picture? Credit Report €9 Only This Document €6 Ratings and Reviews Be the first to review this company! Your Rating: Click on the stars below to rate this company 1 2 3 4 5 Enter your email Company Interaction Please select Bought From Company Supplied To Company Your First Name: Your Location: Press submit below to record your opinion, first name and county. Quick, Reliable and Confidential Company Reports, Credit Ratings and Judgment Searches. WHY GET A REPORT? Make more informed decisions Protect against bad debt Make sure your deposit is safe Reduce invoice payment times Check your competitors SEARCH Location Ireland UK Intl Companies Directors Search Companies Search Directors Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Be"
    },
    {
        "url": "https://find-and-update.company-information.service.gov.uk/company/10047219",
        "title": "L S FOODS LTD overview - Find and update company information - GOV.UK",
        "text": "L S FOODS LTD overview - Find and update company information - GOV.UK Cookies on Companies House services We use some essential cookies to make our services work. We'd also like to use analytics cookies so we can understand how you use our services and to make improvements. Accept analytics cookies Reject analytics cookies View cookies You've accepted analytics cookies. You can change your cookie settings at any time. Hide this message You've rejected analytics cookies. You can change your cookie settings at any time. Hide this message Cookies on Companies House services We use cookies to make our services work and collect analytics information. To accept or reject analytics cookies, turn on JavaScript in your browser settings and reload this page. Skip to main content GOV.UK Find and update company information Companies House does not verify the accuracy of the information filed (link opens a new window) Sign in / Register Search for a company or officer Search Please press ENTER to search Advanced company search Link opens in new window L S FOODS LTD Company number 10047219 Follow this company File for this company Company Overview for L S FOODS LTD (10047219) Filing history for L S FOODS LTD (10047219) People for L S FOODS LTD (10047219) More for L S FOODS LTD (10047219) Registered office address 51 Eastbourne Road, Middlesbrough, England, TS5 6QN Company status Active Company type Private limited Company Incorporated on 7 March 2016 Accounts Next accounts made up to 31 March 2025 due by 31 December 2025 Last accounts made up to 31 March 2024 Confirmation statement Next statement date 15 June 2026 due by 29 June 2026 Last statement dated 15 June 2025 Nature of business (SIC) 47110 - Retail sale in non-specialised stores with food, beverages or tobacco predominating Tell us what you think of this service (link opens a new window) Is there anything wrong with this page? (link opens a new window)"
    },
    {
        "url": "https://lovincatering.com/",
        "title": "Lovin Catering Dublin | Fresh & Homemade Gourmet Food",
        "text": "Lovin Catering Dublin | Fresh & Homemade Gourmet Food Hit enter to search or ESC to close 0 LOVIN CATERING DUBLIN Fresh & Homemade Gourmet Food to Suit Everyone’s Taste Buds You can browse our Full Menu or Contact Natasha on 01-4544912 ABOUT US PLACE AN ORDER ABOUT US Lovin Catering has been trading for the last ten years supplying Catering for Corprate and Home Events in Dublin & Surounding areas. It was established by Kevin & Natasha in 2010 after taking over from the Gallic Kitchen. They have expanded the Menu and Services on offer. A warm welcome awaits you in our little cafe on Francis Street, Dublin 8 where the Food is Baked freshly everyday. At Lovin Catering we make all our food by hand from scratch in our Kitchen. CORPORATE CATERING We also provide a Professional Catering Service for Corporate Lunches, Outdoor Events. Servicing Offices big & small across Dublin... Learn More HOME CATERING We specialise in making family occasions memorable. Offering fully serviced catering and we will tailor our services to meet your needs... Learn More FIND US 49 Francis St, The Liberties, Dublin 8, D08 V3P6 GET DIRECTIONS CALL US - 01 454 4912 EMAIL US OPENING HOURS Monday - Saturday: 7:30am - 4:00pm Sunday: Closed GREAT REVIEWS “ This place has fantastic food all freshly made on premises and great value, I would highly recommend this catering company to everyone, it's fab Jim Merrigan “ Extremely helpful and polite staff. Has a simple yet elegant service structure. Their canapés are to die for and their service is seamless. Would recommend their catering services as well as their Francis Street outlet if looking for a quick bite. Koushik Kumar Nundy “ We were having a particularly difficult day at work in the Misa Building in St James's Hospital when I received a call to say Lovin Catering had a delivery for the 'Feed the Heroes' campaign. We received the most beautiful wraps and soup, you have no idea how much this means to the hard working staff on the wards. THANK YOU SO MUCH Mary Casey “ Absolutely the tastiest sandwiches in dublin and backed up by excellent service with some real Dublin characters. I got lots of sandwiches for an event i was doing in Derry i had to guard the sandwiches it was like keeping the kids away from grannys freshly baked cakes. Really good food Edward Dillon “ Only discovered this place a few weeks ago and even though it's way out of my way it's well worth as food is lovely coffee is great and the prices are very reasonable Gideon Cilliers “ The best \"Flapjack\" ever. Had one yesterday afternoon. Congrats to all the Staff & Cooks. Denise Dunn CATERING FOR YOUR NEXT EVENT Let us help you plan your next event big or small. Our staff will gladly help you with all your Menu and Catering Services. You can browse our Full Menu or Contact Natasha on 01-4544912. MAKE AN ENQUIRY PLACE AN ORDER OPENING HOURS Monday - Saturday: 7:30am - 4:00pm Sunday: Closed CONTACT US Tel: +353 (0) 1 454 4912 Email: [email protected] LOCATION 49 Fran"
    },
    {
        "url": "https://www.mdpi.com/2071-1050/16/16/7237",
        "title": "Access Denied",
        "text": "Access Denied Access Denied You don't have permission to access \"http://www.mdpi.com/2071-1050/16/16/7237\" on this server. Reference #18.56677b5c.1763566542.2e4f102d https://errors.edgesuite.net/18.56677b5c.1763566542.2e4f102d"
    },
    {
        "url": "https://ie.linkedin.com/jobs/view/project-engineer-at-lsc-life-science-consultants-3814790708",
        "title": "LSC, Life Science Consultants hiring Project Engineer in Dublin, County Dublin, Ireland | LinkedIn",
        "text": "LSC, Life Science Consultants hiring Project Engineer in Dublin, County Dublin, Ireland | LinkedIn LinkedIn respects your privacy LinkedIn and 3rd parties use essential and non-essential cookies to provide, secure, analyze and improve our Services, and to show you relevant ads (including professional and job ads ) on and off LinkedIn. Learn more in our Cookie Policy . Select Accept to consent or Reject to decline non-essential cookies for this use. You can update your choices at any time in your settings . Accept Reject Skip to main content Project Engineer LSC, Life Science Consultants Dublin, County Dublin, Ireland Project Engineer LSC, Life Science Consultants Dublin, County Dublin, Ireland 1 year ago Be among the first 25 applicants See who LSC, Life Science Consultants has hired for this role No longer accepting applications Report this job LSC have a great contract opportunity for a Project Engineer to join a South Dublin based Biopharmaceutical company that specializes in secondary manufacturing activities such as Formulation, Fill Finish and Packaging. If you have 3 years engineering experience in the biotechnology industry and are ready for your next challenge, this could be the perfect project for you! ABOUT THE PROJECT - KEY RESPONSIBILITIES: Project management and execution of assigned projects including project prioritization, resources management, status management and external communication. Working with various stakeholders, to scope projects and ensure requirements are satisfied. Project input will span from concept, through design, construction, commissioning and operation Coordinating the introduction of new processes, equipment and materials including problem solving and troubleshooting equipment issues prior to qualification & start-up Development and implementation of maintenance programs and spare parts inventory optimization with the introduction of new equipment. Ability to translate strategic/emerging technology solutions into pragmatic executable plans Development and management of change controls ABOUT YOU - ARE YOUR SKILLS A MATCH? Bachelor's Degree in Engineering (Mechanical, Electrical or Chemical) or Relevant Experience Typically, 3+ years engineering experience, preferably in the biotechnology industry / aseptic pharmaceutical environment or Automated Inspection and/or Automated Device Assembly, Labelling and Ancillary processes. Proven project management experience. Note: Are you currently eligible to work in Ireland? As this is a contract opportunity you will need to hold a Stamp 1G/Stamp 4 visa to apply! Apply via this advert or contact Cian Marnane on 021 4777329 if you have anymore questions about this opportunity! Show more Show less Seniority level Not Applicable Employment type Contract Job function Engineering and Project Management Industries Pharmaceutical Manufacturing Referrals increase your chances of interviewing at LSC, Life Science Consultants by 2x See who you know Get notified about new Project "
    },
    {
        "url": "https://www.slideserve.com/lscpartners/company-registration-in-ireland-a-complete-guide-by-ireland-lsc-partners",
        "title": "PPT - Company Registration in Ireland - A Complete Guide by Ireland LSC Partners PowerPoint Presentation - ID:14318085",
        "text": "PPT - Company Registration in Ireland - A Complete Guide by Ireland LSC Partners PowerPoint Presentation - ID:14318085 Download Presentation Download 1 / 7 Download Download Presentation >> Company Registration in Ireland - A Complete Guide by Ireland LSC Partners Jun 26, 2025 0 likes | 8 Views Forming a Company Registration in Ireland offers unparalleled access to European markets and a globally trusted business base. Let Ireland LSC Partners help you every step of the way. Share Presentation Embed Code Link Download Presentation lscpartners + Follow Download Presentation Company Registration in Ireland - A Complete Guide by Ireland LSC Partners An Image/Link below is provided (as is) to download presentation Download Policy: Content on the Website is provided to you AS IS for your information and personal use and may not be sold / licensed / shared on other websites without getting consent from its author. Content is provided to you AS IS for your information and personal use only. Download presentation by click this link. While downloading, if for some reason you are not able to download a presentation, the publisher may have deleted the file from their server. During download, if you can't get a presentation, the file might be deleted by the publisher. E N D Presentation Transcript 2025 COMPANY REGISTRATION IN IRELAND A COMPLETE GUIDE BY IRELAND LSC PARTNERS Business Marketing www.ireland-lsc-partners.com England, London Phone: +44 203 282 7159 info.uk@tba-associates.com USA, Wilmington Phone: +1 (302) 487 0969 info.us@tba-associates.com Why Register a Company in Ireland? Ireland is one of the most attractive jurisdictions in Europe for business incorporation, thanks to its low corporate tax rate, EU membership, and strong reputation for innovation and transparency. Whether you're starting a local business or expanding globally, registering a company in Ireland gives you access to a stable and business- friendly environment. Key Advantages: Low Corporate Tax Rate: 12.5% on trading income EU Membership: Full access to the European single market Double Tax Treaties: Agreements with over 70 countries Skilled Workforce: Young, educated, and English-speaking talent pool Reputable Business Climate: Transparent legal and regulatory systems www.ireland-lsc-partners.com Types of Companies in Ireland The most commonly registered entity is the Private Company Limited by Shares (LTD). Other types include: Designated Activity Company (DAC) Company Limited by Guarantee (CLG) Public Limited Company (PLC) Branch of a Foreign Company www.ireland-lsc-partners.com Steps to Register a Company in Ireland 1. Choose a Company Name – Must be unique and approved by the Companies Registration Office (CRO) 2. Prepare Incorporation Documents – Constitution (Articles of Association) – Form A1 (company formation form) 3. Appoint Directors and Secretary – Minimum one director (at least one EEA-resident or secure a bond) – Company secretary can be the same 4. person unless "
    }
]