[
    {
        "url": "https://targetare.ro/37971681/square-food-srl",
        "title": "SQUARE FOOD SRL din Cluj-Napoca - CUI 37971681",
        "text": "SQUARE FOOD SRL din Cluj-Napoca - CUI 37971681 Caută nume, cui, website, telefon, etc. SQUARE FOOD SRL Caută nume, cui, website, telefon, etc. SQUARE FOOD SRL Stare firmă: radiata radiată din 21 mart. 2024 Ultima actualizare a datelor: 11 nov. 2025 Risc de insolvență scăzut mediu crescut Informații generale Codul fiscal al companiei SQUARE FOOD SRL din Cluj este 37971681 . Descarcă baze de date cu firme CUI 37971681 Reg. Comerțului J12/4915/2017 EUID ROONRC.J12/4915/2017 Data înființării 13 iulie 2017 8 ani vechime Plătitor TVA TVA la încasare Split TVA CAEN 1071 - Fabricarea painii; fabricarea prajiturilor si a produselor proaspete de patiserie Top firme CAEN 1071 Compania are 8 ani vechime și a fost înființată în anul 2017 . Date de contact GDPR SQUARE FOOD SRL poate fi contactată la numărul de telefon +40*****88 . Telefon +40*****88 Email - Website - Pagina de contact - Retele sociale - Adresa Jud. Cluj, Mun. Cluj-Napoca, Str. Banatului, Nr.7 Top firme din județul Cluj Top firme din Cluj-Napoca Administrator - Sediul social al firmei SQUARE FOOD SRL se afla în Jud. Cluj, Mun. Cluj-Napoca, Str. Banatului, Nr.7 . Grafic evoluție companie Evoluția cifrei de afaceri, a profitului și a numărului de angajați pe ultimii 7 ani de bilanț disponibili. PIB RO reprezintă parcursul economic al României scalat la cifra de afaceri a companiei. Date financiare detaliate 2023 2022 2021 2020 2019 2018 2017 Cifră de afaceri - Profit -14,244 42 Angajați - Datorii 669,415 0 Lichidități 100 Mijloace fixe 100 Active circulante 100 Stocuri - Creanțe - Capitaluri proprii -669,415 2 Capital social 200 0 Dosare în instanță Dosare în instanță unde a fost găsită ca și parte în dosar denumirea SQUARE FOOD SRL Identificarea dosarelor se face utilizând denumirea companiei În România pot exista firme diferite cu aceeași denumire, în astfel de cazuri identificarea dosarelor poate fi eronată. Vă rugăm să verificați personal corectitudinea datelor pe Portalul Instanțelor de Judecată . Calitate de Debitor în dosarul 752/1285/2023 Pagini web relevante Nu au fost găsite pagini web care ar putea avea legătură cu această companie. Evoluție companii similare Au fost găsite companii cu activitate / descriere asemănătoare cu cea a companiei SQUARE FOOD SRL AR LOFF PRODUCT SRL 86 - DELICREMA SRL - delifun.ro TRANSILVANIA TRADITIONAL FOOD SRL - - PERFECT DULCE SRL - - LEON PAN SRL 22 leonevents.ro RAUL PUR DELICE SRL 28253 pannegusto.ro MAYA SIMIGERIE SRL 475 - DELICII DIN BORSA SRL - - DLS BAKERY SRL 3 - LDD GASTRO PRO SRL - - Companii la aceeași adresă Au fost găsite și alte companii la adresa: Jud. Cluj, Mun. Cluj-Napoca, Str. Banatului, Nr.7 SQUARE INSTALL SRL 18 iulie 2025 ALL SOLUTION & DESIGN SRL 16 februarie 2024 ONPURPOSESTUFF SRL 13 iulie 2017 SQUARE IND SRL 13 iulie 2017 POP ERMIONA PFA 23 februarie 2015 COVRIMOBIL SRL 21 februarie 2014 COVRIBIZ SRL-D 10 februarie 2014 Copiază SYNAPTECH SOFTWARE SRL CUI: 42046968 J26/2241/2019 contact@targetare.ro CONȚINUT Informațiile afișate "
    },
    {
        "url": "https://listafirme.ro/square-food-srl-37971681/",
        "title": "SQUARE FOOD SRL",
        "text": "SQUARE FOOD SRL Contul meu Mergi la site-ul vechi Conectați-vă cu Google Continuați cu Facebook Conectați-vă cu Microsoft email sau mobil Parolă Ține-mă minte Conectare Deschide cont Recuperează cont 0373-800.572 Română Română Engleză Arabă Bulgară Cehă Chineză Croată Daneză Finlandeză Franceză Germană Greacă Italiană Japoneză Maghiară Olandeză Poloneză Portugheză Slovacă Spaniolă Suedeză Salvează pagina la favorite Tastează CTRL + D pentru a adăuga pagina la favorite Închide Adaugă criteriu Filtre Suport Discută cu Ania Asistență Clienți Mariana Trașcă vă ajută în intervalul 8-18 L-V. 0372552307 mariana.trasca@listafirme.ro WhatsApp Preferi inteligența artificială? Caută nume firmă, J sau CUI ... SQUARE FOOD SRL Prima oară pe site? Fă-ți cont gratuit sau Accesează cu SMS Ai fost angajat al Square Food? Află cum poți obține o adeverință de vechime în muncă ! Profil firma Date de identificare Contact Localizare pe hartă Descriere firmă Prezentări video Mărci înregistrate Informații financiare Domeniu de activitate Informații statistice Firme conectate Rapoarte detaliate Istoric Restanțe ANAF Inactivitate ANAF Dosare în Justiție Istoric Insolvență Monitorul Oficial Istoric stări Istoric administratori Istoric asociați Istoric Denumiri Puncte de lucru Licitații SEAP Vânzări SEAP Stadiu dosar RECOM Istoric CAEN Firme similare Rapoarte externe Raport CIP Raport ReCom Raport RNPM Detalii de identificare Denumire SQUARE FOOD SRL CUI 37971681 Nr. Reg. Com. J12/4915/2017 EUID ROONRC.J12/4915/2017 Data înființării 2017. . Sediu SQUARE FOOD SRL - informații de contact Județ Cluj Localitate Loc. Cluj Napoca Adresă Str. Banatului 7 Cod 400388 Telefon - 1 șterse Mobil 0760-680.0 - - Email - Adresă web - Persoane din conducere Administratori Asociați Beneficiari Po - - Asociați Po - - Localizare pe hartă 📍 Descrierea firmei SQUARE FOOD SRL Mărci înregistrate la OSIM Nu este cazul. Date de bilanț ale firmei SQUARE FOOD SRL Cifra afaceri Profit net Datorii totale Active imobilizate Active circulante Capitaluri proprii Număr salariați 2022 -24 646 670 03 14 244 615 -655 171 2021 8 00 -29 593 670 614 38 239 1 851 -630 524 2020 24 326 -72 696 666 016 64 65 435 -600 931 1 2019 13 495 -411 81 623 292 91 06 3 997 -528 235 7 2018 -115 786 254 688 117 471 20 791 -116 426 3 2017 -84 1 327 687 -64 1 Moneda RON EUR USD (cu 0 apar și valorile nedeclarate) Domeniul de activitate al SQUARE FOOD SRL Cod CAEN preponderent 1071 Rev. 2 (echivalent cu 1071 Rev. 3) Obiect Activitate Fabricarea painii; fabricarea prajiturilor si a produselor proaspete de patiserie Descriere Activitate Aceasta clasa includ - - Cod CAEN principal 10 - - (echivalent cu 10 - - Rev. 3) Obiect Activitate Fabri - - Descriere Activitate Aceasta clasa includ - - Informații statistice Număr asociați 2 - - Număr administratori 1 - - Sucursale 0 - - Număr sedii secundare 2 - - Categorie de mărime microîntreprindere Alte Companii Recomandate Nr. Nume Firmă Contact 1 CLS FURNITURE SRL Str. Somesului 5A Jud. CLUJ, "
    },
    {
        "url": "https://www.confidas.ro/profil/37971681/square-food-srl",
        "title": "SQUARE FOOD S.R.L.  - CUI: 37971681 -  Cluj-Napoca  - Informatii Complete | Confidas",
        "text": "SQUARE FOOD S.R.L. - CUI: 37971681 - Cluj-Napoca - Informatii Complete | Confidas SQUARE FOOD S.R.L. CUI: 37971681 Raport limitat pentru non-membri Confidas Platforma de rapoarte de credit Confidas a fost achiziționată de Termene.ro la începutul anului 2023 search Informații complete despre +650.000 firme Verifică gratuit! Your browser does not support HTML5 video. Cauta firme Lista firme Romania Cauta firme Cluj Cauta firme Cluj-Napoca -67.11% 8,000 RON Cifra de Afaceri Ultimul an raportat: 2021 N/A -29,593 RON Profit Net +0.00% 0 Numar Mediu de Angajati Incidente de plată înregistrate de utilizatori Informații despre TVA Obligații fiscale restante Dosare in instanță Fara contracte de achiziții publice! Stare ONRC - Funcțiune Datele companiei SQUARE FOOD S.R.L. Denumire SQUARE FOOD S.R.L. C.U.I. 37971681 Nr. Înreg la Reg. Com J12/4915/2017 EUID ROONRC.J12/4915/2017 Adresă Cluj-Napoca, Str BANATULUI, Nr 7, Judet Cluj Telefon ***-***-**** Județ Cluj Cod postal 000000 Fax Descriere Firma SQUARE FOOD S.R.L.(CUI 37971681) are sediul în Cluj și a fost înființata pe 13/07/2017. Există informații despre 1 administrator. În 2021, compania a raportat o cifră de afaceri de 8.000 RON , pierdere de -29.593 RON (marjă de -369.91%) si angaja persoane, având ca obiect principal de activitate codul CAEN 1071(Fabricarea pâinii:fabricarea prăjiturilor și a produselor proaspete de patiserie). Înregistrează-te pentru a verifica firma și pentru a căuta informații și despre alte firme. Stare la Reg.Com. Compania este în stare de funcționare! Cod CAEN 1071 - Fabricarea pâinii; fabricarea prăjiturilor şi a produselor proaspete de patiserie Vezi firme similare - Lista firme 1071 - Fabricarea pâinii; fabricarea prăjiturilor şi a produselor proaspete de patiserie Asociați și administratori - SQUARE FOOD S.R.L. Nr. administratori 1 Nr. asociați/acționari Legături asociați și administratori Relațiile persoanelor din conducere cu alte firme Vezi cine deține această societate și istoricul administratorilor „Caracatiță” - legături cu alte firme Istoric firme în insolvență Lista asociaților Deschide cont gratuit! Află detalii Informații financiare - SQUARE FOOD S.R.L. (Ultimul bilanț depus: 2021 ) RON 2021 2020 2019 2018 Cifra de afaceri neta 8.000 24.326 13.495 - Cheltuieli totale 37.513 103.478 425.171 115.786 Profit net -29.593 -72.696 -411.810 -115.786 Rata Profitului Net -369,91% -298,84% -3.051,57% 0,00% Numar mediu de angajați - 1 7 3 Incidente de plată înregistrate de utilizatori Incidente de plată înregistrate de utilizatori Asigură-te că ești plătit la timp verificând dacă această societate are facturi neplătite către furnizori. Membrii comunității Confidas înregistrează incidente de plată pentru a alerta alți membrii cu privire la comportamentul de plată al clienților lor rău-platnici. Deschide cont gratuit! Află detalii Informații financiare detaliate - SQUARE FOOD S.R.L. Date din bilanț Vezi starea financiară istorică a companiei analizând 19 indicatori financiari p"
    },
    {
        "url": "https://www.romanian-companies.eu/square-ind-srl-37972652/",
        "title": "Company SQUARE IND SRL tax code 37972652 from Romania",
        "text": "Company SQUARE IND SRL tax code 37972652 from Romania ROMANIAN COMPANIES Log in Mergi la site-ul nou Sign in with Google stay logged Create free account Account recovery Romanian English Home Databases Company List SQUARE IND SRL Search a company ROMANIA ALBA ARAD ARGES BACAU BIHOR BISTRITA NASAUD BOTOSANI BRASOV BRAILA BUCURESTI BUZAU CARAS SEVERIN CALARASI CLUJ CONSTANTA COVASNA DAMBOVITA DOLJ GALATI GIURGIU GORJ HARGHITA HUNEDOARA IALOMITA IASI ILFOV MARAMURES MEHEDINTI MURES NEAMT OLT PRAHOVA SATU MARE SALAJ SIBIU SUCEAVA TELEORMAN TIMIS TULCEA VASLUI VALCEA VRANCEA Search Advanced search Log in Mergi la site-ul nou Sign in with Google stay logged Create free account Account recovery Search a company ROMANIA ALBA ARAD ARGES BACAU BIHOR BISTRITA NASAUD BOTOSANI BRASOV BRAILA BUCURESTI BUZAU CARAS SEVERIN CALARASI CLUJ CONSTANTA COVASNA DAMBOVITA DOLJ GALATI GIURGIU GORJ HARGHITA HUNEDOARA IALOMITA IASI ILFOV MARAMURES MEHEDINTI MURES NEAMT OLT PRAHOVA SATU MARE SALAJ SIBIU SUCEAVA TELEORMAN TIMIS TULCEA VASLUI VALCEA VRANCEA Search SQUARE IND SRL First time here? Create free account or Access by SMS Were you employed by the Square Ind? Find out how to get a Work Attestation ! Company Identification data Trademarks Company description Video presentations Contact Map localization Activity domain Financial info Statistic info Old names ANAF status Status history Administrator history Shareholder history Working points SEAP auctions State debts Insolvency O.J. Files BPI ANAF More Trademarks ReCom file Similar companies Connected companies Identification data for SQUARE IND SRL Company Name SQUARE IND SRL Fiscal Code 37972652 Registry No. J12/4939/2017 EUID ROONRC.J12/4939/2017 Date of establishment 2017. . OSIM registered Trademarks None. About SQUARE IND SRL company Contact information of Square Ind like detailed information (balance sheets, court cases, registered trademarks, etc.) are available only for registered members. In order to get in touch with Square Ind or other companies included in catalog please login with your account. The active companyes are included on the Romanian-Companies CD and new features are available according the chosen access plan . Localization of SQUARE IND SRL - contact information. County Cluj City/District Loc. Cluj Napoca Address Str. Banatului 7 Cod 400388 Phone - 1 contacts removed Mobile 0746-303.8 - - Email - 1 contacts removed Management people: Admin. Administrators Shareh. Shareholders Benef. Beneficiaries Web Address - Map localization Predominant activity domain (reported on the balance sheet) NACE Code 9329 Rev. 2 (like 9329,9319,9312,9311,8425 Rev. 3) Activity Other amusement and recreation activities Activity Description This class includes - - Mmain activity domains (according registration certificate) NACE Code 93 - - (like 93 - - Rev. 3) Activity Other - - Turnover Net Profit Debts Fixed Assets Current Assets Equity Ownership Employees (average no.) 2023 1 990 -5 704 58 811 0 -266 -59 077 0 2022 8"
    },
    {
        "url": "https://gr.kompass.com/z/ro/a/meals-ready-prepared-fish-based/0339038/",
        "title": "\n            Companies - Meals, ready prepared, fish based - Romania | Kompass Business Directory ",
        "text": "Companies - Meals, ready prepared, fish based - Romania | Kompass Business Directory Companies Products / Services Search too broad × Please refine your search by (Localization + What, who? Activity, company ...) Edit search Login / Register My account English Available languages English Agriculture & Food Business Services Chemicals, Pharmaceuticals & Plastics Construction Education, Training & Organisations Electrical, Electronics & Optical Energy, Environment IT, Internet, R&D Leisure & Tourism Metals, Machinery & Engineering Minerals Paper, Printing, Publishing Retail & Traders Textiles, Clothing, Leather, Watchmaking, Jewellery Transport & Logistics Agriculture & Food Importers Exporters Service providers Producer Distributor Agricultural and forestry machinery and equipment Agriculture and forestry Beverages Food Food, drink, tobacco and catering industry machinery and equipment Livestock and fish Organic products Business Services Importers Exporters Service providers Producer Distributor Financial and insurance services Hire and rental services Hygiene and cleaning Services to businesses Chemicals, Pharmaceuticals & Plastics Importers Exporters Service providers Producer Distributor Chemical base materials Chemical industry plant and equipment Chemical products Health, medical and pharmaceutical Plastic products Rubber and plastic industry plant and equipment Rubber products Construction Importers Exporters Service providers Producer Distributor Building industry Civil and marine engineering contractors Civil engineering and building machinery and equipment Furniture and linen Hardware, ironmongery, cutlery and tools Heating, ventilation, air conditioning (HVAC) and refrigeration equipment Metal constructions for the building industry Metal pipework, valves and containers Security equipment Timber, wooden products, machinery and equipment for the woodworking industry Education, Training & Organisations Importers Exporters Service providers Producer Distributor Education and training International organisations, administrations and associations Social care, personal services Electrical, Electronics & Optical Importers Exporters Service providers Producer Distributor Electrical equipment. Nuclear equipment Electronic equipment. Telecommunications equipment Measuring and testing equipment Optical, photographic and cinematographic equipment Energy, Environment Importers Exporters Service providers Producer Distributor Energy, fuel and water Environmental services, renewable energies Oil and gas industry plant and equipment IT, Internet, R&D Importers Exporters Service providers Producer Distributor Information technology (IT) and Internet Research and testing Technical offices and engineering consultancies, architects Leisure & Tourism Importers Exporters Service providers Producer Distributor Hospitality, tourism, hotel and catering industries Leisure, culture and entertainment Postal services, telecommunications, radio and television Sports"
    },
    {
        "url": "https://www.frachtgroup.com/en/locations",
        "title": "Locations | Fracht Group",
        "text": "Locations | Fracht Group Skip to main content Request a Quote Language English Deutsch Italiano Polski Türkçe Español Portuguese, Brazil Français Nederlands Language English Deutsch Italiano Polski Türkçe Español Portuguese, Brazil Français Nederlands Login Track & Trace Contact Us About Values and Culture Leadership History Careers Inter Miami CF Partnership Corporate Compliance QHSE and Security Subsidiary Solutions Air Freight Charters Ocean Freight Road Freight Rail Freight Project Cargo 4PL Warehousing Free Trade Zone Customs Brokerage Value-Add Services Green Logistics Intermodal and Multimodal Logistics Live Animal Transport Remote Location Logistics Locations Industries Automotive Aid and Relief Chemicals Consumer Goods/Retail Defense and Government Energy and Industrial Renewable Energy High-Tech Food and Beverage Metals and Mining Sustainability Strategy and Approach Insights News Case Studies About Values and Culture Leadership History Careers Inter Miami CF Partnership Corporate Compliance QHSE and Security Subsidiary Solutions Air Freight Charters Ocean Freight Road Freight Rail Freight Project Cargo 4PL Warehousing Free Trade Zone Customs Brokerage Value-Add Services Green Logistics Intermodal and Multimodal Logistics Live Animal Transport Remote Location Logistics Locations Industries Automotive Aid and Relief Chemicals Consumer Goods/Retail Defense and Government Energy and Industrial Renewable Energy High-Tech Food and Beverage Metals and Mining Sustainability Strategy and Approach Insights News Case Studies About Values and Culture Leadership History Careers Inter Miami CF Partnership Corporate Compliance QHSE and Security Subsidiary Solutions Air Freight Charters Ocean Freight Road Freight Rail Freight Project Cargo 4PL Warehousing Free Trade Zone Customs Brokerage Value-Add Services Green Logistics Intermodal and Multimodal Logistics Live Animal Transport Remote Location Logistics Locations Industries Automotive Aid and Relief Chemicals Consumer Goods/Retail Defense and Government Energy and Industrial Renewable Energy High-Tech Food and Beverage Metals and Mining Sustainability Strategy and Approach Insights News Case Studies About Values and Culture Leadership History Careers Inter Miami CF Partnership Corporate Compliance QHSE and Security Subsidiary Solutions Air Freight Charters Ocean Freight Road Freight Rail Freight Project Cargo 4PL Warehousing Free Trade Zone Customs Brokerage Value-Add Services Green Logistics Intermodal and Multimodal Logistics Live Animal Transport Remote Location Logistics Locations Industries Automotive Aid and Relief Chemicals Consumer Goods/Retail Defense and Government Energy and Industrial Renewable Energy High-Tech Food and Beverage Metals and Mining Sustainability Strategy and Approach Insights News Case Studies Language English Deutsch Italiano Polski Türkçe Español Portuguese, Brazil Français Nederlands Language English Deutsch Italiano Polski Türkçe Español Portuguese, Brazil Français Ne"
    },
    {
        "url": "https://www.topfirme.com/afacere/square-food-s-r-l-/5hti7q19ek/",
        "title": "SQUARE FOOD S.R.L. din Str. BANATULUI, nr. 7, Cluj-Napoca",
        "text": "SQUARE FOOD S.R.L. din Str. BANATULUI, nr. 7, Cluj-Napoca search Cauta o firma Autentificare Inregistrare Top Firme Judetul Cluj Cluj-Napoca SQUARE FOOD S.R.L. SQUARE FOOD S.R.L. INREGISTRAT din data 13 Iulie 2017 Date de contact Informatii de identificare si locatia pe harta SQUARE FOOD S.R.L. Cod fiscal: 37971681 Nr. registrul comertului: J12/4915/2017 Adresa: Str. BANATULUI, nr. 7 Localitate: Cluj-Napoca Judet: Judetul Cluj Telefon: 0760680088 Fax: - Este firma ta? Raporteaza o problema Domeniul de activitate Cod CAEN: 1071 | 1071 in Judetul Cluj | 1071 in Cluj-Napoca Fabricarea painii, fabricarea prajiturilor si a produselor proaspete de patiserie Bilanturi contabile Bilanturile depuse la Registrul Comertului An Cifra de afaceri Profit brut/Pierdere Profit net/Pierdere Venituri Cheltuieli Venituri avans Cheltuieli avans Capitaluri total Capital social Active imobilizate total Active circulante total Stocuri Creante Casa conturi Datorii Provizioane Patrimoniul public Patrimoniul regiei Numar angajati Cod CAEN Text CAEN An Cifra de afaceri (ron) Profit brut / Pierdere (ron) Profit net / Pierdere (ron) Venituri (ron) Cheltuieli (ron) Venituri avans (ron) Cheltuieli avans (ron) Capitaluri total (ron) Capitaluri social (ron) Active imobilizate total (ron) Active circulante total (ron) Stocuri (ron) Creante (ron) Casa conturi (ron) Datorii (ron) Provizioane (ron) Patrimoniul public (ron) Patrimoniul regiei (ron) Numar mediu angajati Cod CAEN Text CAEN 2023 0 - 14.244 - 14.244 0 14.244 0 0 -669.415 200 0 0 0 0 0 669.415 0 0 0 0 1071 Fabricarea painii, fabricarea prajiturilor si a produselor proaspete de patiserie 2022 0 - 24.646 - 24.646 0 24.646 0 0 -655.171 200 14.244 615 0 0 615 670.030 0 0 0 0 1071 Fabricarea painii, fabricarea prajiturilor si a produselor proaspete de patiserie 2021 8.000 - 29.513 - 29.593 8.000 37.513 0 0 -630.524 200 38.239 1.851 0 0 1.851 670.614 0 0 0 0 1071 Fabricarea painii, fabricarea prajiturilor si a produselor proaspete de patiserie 2020 24.326 - 72.460 - 72.696 31.018 103.478 0 0 -600.931 200 64.650 435 0 0 435 666.016 0 0 0 1 1071 Fabricarea painii, fabricarea prajiturilor si a produselor proaspete de patiserie 2019 13.495 - 411.676 - 411.810 13.495 425.171 0 0 -528.235 200 91.060 3.997 0 0 3.997 623.292 0 0 0 7 1071 Fabricarea painii, fabricarea prajiturilor si a produselor proaspete de patiserie 2018 0 - 115.786 - 115.786 0 115.786 0 0 -116.426 200 117.471 20.791 18.416 0 2.375 254.688 0 0 0 3 1071 Fabricarea painii, fabricarea prajiturilor si a produselor proaspete de patiserie 2017 0 - 840 - 840 0 840 0 0 -640 200 0 687 0 0 687 1.327 0 0 0 1 1071 Fabricarea painii, fabricarea prajiturilor si a produselor proaspete de patiserie Cifra de afaceri Grafic evolutie cifra de afaceri Profit Grafic evolutie profit net realizat Numar de angajati Grafic evolutie numar de angajati Venituri/Cheltuieli Grafic evolutie venituri in raport cu cheltuielile Marja de profit Grafic evolutie marja de profit Competitori Cifra de aface"
    },
    {
        "url": "https://www.tripadvisor.com/Restaurant_Review-g298474-d11954999-Reviews-The_Brave_Pub_Srl-Cluj_Napoca_Cluj_County_Northwest_Romania_Transylvania.html",
        "title": "tripadvisor.com",
        "text": "tripadvisor.com Please enable JS and disable any ad blocker"
    },
    {
        "url": "https://burgerking.ro/en/",
        "title": "Burger King",
        "text": "Burger King You need to enable JavaScript to run this app."
    },
    {
        "url": "https://www.taco-bell.ro/en/taco-bell-takes-the-step-at-national-level-and-opens-the-first-restaurant-outside-the-capital-in-cluj-napoca/",
        "title": "TACO BELL TAKES THE STEP AT NATIONAL LEVEL AND OPENS THE FIRST RESTAURANT OUTSIDE THE CAPITAL, IN CLUJ-NAPOCA - Taco Bell",
        "text": "TACO BELL TAKES THE STEP AT NATIONAL LEVEL AND OPENS THE FIRST RESTAURANT OUTSIDE THE CAPITAL, IN CLUJ-NAPOCA - Taco Bell Skip to content × Taco Bell Live Mas TACO BELL TAKES THE STEP AT NATIONAL LEVEL AND OPENS THE FIRST RESTAURANT OUTSIDE THE CAPITAL, IN CLUJ-NAPOCA Just days before the holidays, Taco Bell announces the nationwide expansion. The brand entered the Romanian market in October last year and has so far reached four units placed in shopping centers in Bucharest. The newest restaurant will be inaugurated in Iulius Mall in Cluj-Napoca, on Saturday, December 22nd. With an investment of 350,000 euros, he expects the people of Cluj to try the original products, of Mexican inspiration, and with a different experience, in the spirit of #livemas. The new unit will welcome the fans starting Saturday, December 22, in the food court area on the first floor of the Iulius Mall shopping center in Cluj-Napoca. The restaurant has an area of ​​110 square meters and is the result of an investment of 350,000 euros. “Taco Bell had excellent results in the first year of activity on the local market, through restaurants in Bucharest, so we wanted our products to be accessible nationally. Cluj-Napoca is part of the first set of destinations we are pursuing, being a city with an accelerated development, in recent years, from an economic perspective, as well as from a cultural, musical and culinary point of view. Cluj residents are open to new experiences and we are glad to be able to offer them the #livemas experience. In addition, the opening timing is very good, because the weekend before Christmas and, in general, the winter holidays, is a time when people go out a lot in the city and often come to the mall, for shopping, to spend time. quality with those close to you and, why not, to try new things. With this promise, we look forward to seeing them at Taco Bell, ” said Mark Hilton, CEO of Sphera Franchise Group. With the inauguration of this restaurant, Taco Bell has created 35 jobs, the new team being ready to serve customers starting Saturday, December 22, and offer them delicious, Mexican-inspired products such as: Crunchy Taco, Cheesy Bacon Fries Burrito, Quesadilla, Crunchwrap Supreme, Nachos Supreme or Churros. Read more: Taco Bell opens a new restaurant in Promenada... Citește articolul >> Taco Bell Romania expanded its network, with... Citește articolul >> Over 3.1 million tacos and 45 tons of Nacho... Citește articolul >> Taco Bell launches a loyalty program dedicated... Citește articolul >> Taco Bell inaugurates the second restaurant... Citește articolul >> Taco Bell celebrates 4 years of #livemas... Citește articolul >> The spirit of #livemas arrives in Bacău,... Citește articolul >> OUR COMMITMENT TO ANIMAL WELFARE Citește articolul >> TACO BELL REINVENTS THE WAY OF SERVING PRODUCTS,... Citește articolul >> TACO BELL CELEBRATES TACOS IN ROMANIA, EVERYTHING... Citește articolul >> TACO BELL BRINGS THE SPIRIT #LIVEMAS TO IAŞI,... Citește artic"
    }
]