[
    {
        "url": "https://www.yelp.com/biz/the-hungry-mexican-dublin",
        "title": "yelp.com",
        "text": "yelp.com Please enable JS and disable any ad blocker"
    },
    {
        "url": "https://www.vision-net.ie/Company-Info/The-Hungry-Mexican-Restaurant-Limited-578773",
        "title": "The Hungry Mexican Restaurant Limited - Irish Company Info",
        "text": "The Hungry Mexican Restaurant Limited - Irish Company Info BLOG JOIN UP TOP-UP ABOUT LOGIN The Hungry Mexican Restaurant Limited Summary Latest Updates Credit Score Business Checks Company Summary The Hungry Mexican Restaurant Limited was set up on Wednesday the 9th of March 2016. Their current partial address is Dublin, and the company status is Normal. The company's current director has been the director of 0 other Irish companies. The Hungry Mexican Restaurant Limited has 2 shareholders. This Irish company shares its Eircode with at least 1 other company. Company Name: The Hungry Mexican Restaurant Limited Company Status: NORMAL Company Address: 5 Aston Quay, Dublin 2, Dublin Key Executive: Mr Madooree Company Size: Log-In To View Key Contact Profile Mr Madooree is a Company Director of The Hungry Mexican Restaurant Limited since 2016 Generate a B2B Marketing List with ease and grow your business. Identify key decision makers and pre-qualified new prospects for your sales and business development teams. Similar Companies - Create a marketing list of similar companies Latest Updates The latest documents filed with the Companies Registration Office for The Hungry Mexican Restaurant Limited (which can include the Account Details) are listed below. CRO Document Effective Date Received By CRO View Now Form B1C - Annual Return General 09/09/2025 04/11/2025 Join Up FINANCIAL STATEMENT 09/09/2025 04/11/2025 Join Up Form B1C - Annual Return General 09/09/2024 04/11/2024 Join Up FINANCIAL STATEMENT 09/09/2024 04/11/2024 Join Up Form B1C - Annual Return General 09/09/2023 02/11/2023 Join Up THIS COMPANY HAS 18 OTHER DOCS » View CRO company documents and company reports any Irish company or business with ease. Credit Report View the Latest Credit Report and Credit Limit on The Hungry Mexican Restaurant Limited. Company Status: Normal Latest Credit Movement: Date of Last Movement: 06/11/2025 Latest Accounts Filed: 04/11/2025 Report Based on Accounts: 31/03/2025 Next Set of Accounts Due: 09/09/2026 Overdue: No Credit Score: Join-Up to View Full Credit Rating To View the latest Credit Rating or Credit Limit on The Hungry Mexican Restaurant Limited simply click 'Log-In' or 'Join-Up' below. Log-In Join-Up Vision-net Credit Scores save your business the time and cost of chasing slow payers. Evaluate risk at client application stage or run continuous credit checks on your full customer base. Directors & Owners Satisfy due diligence requirements on The Hungry Mexican Restaurant Limited in one single 'time-saving' search. Run full background checks for Fitness and Probity on the directors of The Hungry Mexican Restaurant Limited and Anti-Money Laundering checks (AML checks) on The Hungry Mexican Restaurant Limited Directors details are available to logged in users. Ownership Structure Company Type: LTD - Private Company Limited By Shares Number of Shareholders: 2 Compliance Log-in now to run Due Diligence checks and Compliance checks on The Hungry Mexican Restaura"
    },
    {
        "url": "https://www.solocheck.ie/Irish-Company/The-Hungry-Mexican-Restaurant-Limited-578773",
        "title": "The Hungry Mexican Restaurant Ltd - Irish Company Info - SoloCheck",
        "text": "The Hungry Mexican Restaurant Ltd - Irish Company Info - SoloCheck Login Join 0 items Added to your basket No Items in your basket! 0 Items in your basket Checkout The Hungry Mexican Restaurant Limited Updated: 11 hours ago 360 Views Add My Company Details Tweet Share Facebook LinkedIn Email Vitals Directors Credit Score Judgments Documents Summary The Hungry Mexican Restaurant Limited was set up on Wednesday the 9th of March 2016. Their current partial address is Dublin, and the company status is Normal. The company's current director has been the director of 0 other Irish companies. The Hungry Mexican Restaurant Limited has 2 shareholders. This Irish company shares its Eircode with at least 1 other company. Credit Score Latest Credit Movement: Date of Last Movement: 06/11/2025 Latest Accounts Filed: 04/11/2025 Report Based On Accounts: 31/03/2025 Next Set of Accounts Due: 09/09/2026 Overdue: No Credit Report Credit Report & Financials Company Printout Report Directors & Owners Report Bad Debt Judgments Report Mortgages Report View a sample report €9 Company Vitals Company Name: The Hungry Mexican Restaurant Limited Time in Business: 9 Years Company Number: 578773 Company Size: Micro Company Current Status: NORMAL Principal Activity: [5610] Restaurants and Mobile Food Service Activities May Trade As: The Hungry Mexican Restaurant Ltd Add My Company Details Registered Address: 5 Aston Quay , Dublin 2, Dublin D02 K504 Standard Report Full Company Vitals, including Directors & Mortgages View a sample report €3 Directors Purchase either the Standard Company Report or a Credit Report to view details on the directors of this company. Documents Document Pages Effective Received Buy NEW! Form B1C - Annual Return General 4 09/09/2025 04/11/2025 NEW! FINANCIAL STATEMENT 8 09/09/2025 04/11/2025 Form B1C - Annual Return General 4 09/09/2024 04/11/2024 FINANCIAL STATEMENT 9 09/09/2024 04/11/2024 FINANCIAL STATEMENT 11 09/09/2023 02/11/2023 Certificate of Incorporation 1 09/03/2016 24/02/2016 Constitution 1 09/03/2016 24/02/2016 This company has 16 other documents » X Want More Insight? Did you know our Credit Report includes full financials for up to 5 years, credit score/limit, ratios, history and so much more to help you view the full picture? Credit Report €9 Only This Document €6 Ratings and Reviews Average Rating: 5 / 5 voted by 1 user 1 2 3 4 5 Your Rating: Click on the stars below to rate this company 1 2 3 4 5 Enter your email Company Interaction Please select Bought From Company Supplied To Company Your First Name: Your Location: Press submit below to record your opinion, first name and county. Quick, Reliable and Confidential Company Reports, Credit Ratings and Judgment Searches. WHY GET A REPORT? Make more informed decisions Protect against bad debt Make sure your deposit is safe Reduce invoice payment times Check your competitors SEARCH Location Ireland UK Intl Companies Directors Search Companies Search Directors Afghanistan Albania Algeria Amer"
    },
    {
        "url": "https://thehungrymexicantemplebar.ie/order-now",
        "title": "Access denied | thehungrymexicantemplebar.ie used Cloudflare to restrict access | thehungrymexicantemplebar.ie | Cloudflare",
        "text": "Access denied | thehungrymexicantemplebar.ie used Cloudflare to restrict access | thehungrymexicantemplebar.ie | Cloudflare Please enable cookies. Error 1009 Ray ID: 9a1178f8d975c278 • 2025-11-19 17:36:55 UTC Access denied What happened? The owner of this website (thehungrymexicantemplebar.ie) has banned the country or region your IP address is in (BG) from accessing this website. Please see https://developers.cloudflare.com/support/troubleshooting/http-status-codes/cloudflare-1xxx-errors/error-1009/ for more details. Was this page helpful? Yes No Thank you for your feedback! Cloudflare Ray ID: 9a1178f8d975c278 • Your IP: Click to reveal 81.161.249.102 • Performance & security by Cloudflare"
    },
    {
        "url": "https://www.yelp.com/biz/the-hungry-mexican-restaurant-dublin",
        "title": "yelp.com",
        "text": "yelp.com Please enable JS and disable any ad blocker"
    },
    {
        "url": "https://thesecret.app/secrets/3724/the-hungry-mexican",
        "title": "The Secret App",
        "text": "The Secret App Chat with us , powered by LiveChat"
    },
    {
        "url": "https://www.happycow.net/reviews/the-hungry-mexican-dublin-117679",
        "title": "The Hungry Mexican - Dublin  Restaurant - HappyCow",
        "text": "The Hungry Mexican - Dublin Restaurant - HappyCow Looks like your browser doesn't support JavaScript. HappyCow may not work without JavaScript enabled. Search HappyCow Search Search Search Search Search Search Welcome to HappyCow! Join the largest vegan and vegetarian community in the world. or Username or Email Password Remember me Forgot Password? Login Signup Join the largest vegan and vegetarian community in the world. or Member Account Recovery Request Please enter the email address used to register your account, and we will email you instructions to reset password. Email Continue If you are having difficulty with this process, please contact us or Not a member? Create a new account I'm an owner 44 All Photos (44) The Hungry Mexican (59) 115 Loading... Veg-options Lacto Beer/Wine Delivery Take-out Mexican Catering Gluten-free Latin Non-veg Serves meat, vegan options available. Mexican restaurant offering soy mince and jack fruit in place of meat in dishes. Has labeled vegan options. Open Mon-Wed 16:00-22:00, Thu 16:00-23:00, Fri-Sat 12:00-23:00, Sun 15:00-22:00. More Add Review Add Photos Call Website Share Trip Favorite © OpenStreetMap contributors 5 Aston Quay , Dublin , Ireland , D02 PN56 Loading... +353-894502305 thehungrymexican.ie Wheelchair accessible Accepts credit cards Free Wi-Fi Last update on 04 Nov 2025 by Lauraleec Update business info Are you the owner? Claim this business Add Review Add Photos 59 Reviews First Review by _hael Default Newest First Oldest First Highest Rating Lowest Rating Veg Status Most Points Results 18 27 81 frau_mit_hund Points +258 Vegan 09 Mar 2025 Immer wieder lecker - Edit Großartige vegane Optionen, schmeckt super. Komme wieder.😄 Read more Guest By submitting this post you agree to HappyCow Terms Post Comment Share Nadine_vegan Points +62 Vegan 21 Feb 2025 Richtig leckeres Essen - Edit Süßer kleiner Laden, mit leckerem Essen. Es gab vorweg Tostadas und danach Chimichanga. Beides war köstlich. Klare Empfehlung! Read more Pros: Tolle Auswahl , Sehr freundlicher Service Guest By submitting this post you agree to HappyCow Terms Post Comment Share gemmamcconvillewebb Points +70 Vegan 30 Dec 2024 Not the best - Edit The food was great, had a vegan soya meat chilli chimichanga with vegan cheese. But the service was HORRIFIC!! 1 guy was running the entire restaurant/bar/kitchen. Was stressful and not enjoyable environment, very slow and it let the good food down. Read more Pros: Great food, Good vegan options Cons: Terrible service , Kitchen looked dirty Guest By submitting this post you agree to HappyCow Terms Post Comment Share rodrigoazs Points +3223 Vegan 29 Dec 2024 Excellent chimichanga - Edit The chimichanga for 2 people is big and very tasty. They have vegan cheese. Read more Guest By submitting this post you agree to HappyCow Terms Post Comment Share JoannaHopkins Points +77 Vegan 16 Aug 2024 So so - Edit We got chilli soya. Portions were big but after a few mouthfuls it tasted very samey (the typica"
    },
    {
        "url": "https://www.tripadvisor.co.uk/LocationPhotoDirectLink-g186605-d5570591-i373273127-The_Hungry_Mexican_Restaurant-Dublin_County_Dublin.html",
        "title": "tripadvisor.co.uk",
        "text": "tripadvisor.co.uk Please enable JS and disable any ad blocker"
    }
]