[
    {
        "url": "https://www.solocheck.ie/Irish-Company/Uncle-Fast-Food-Limited-711829",
        "title": "Uncle Fast Food Ltd - Irish Company Info - SoloCheck",
        "text": "Uncle Fast Food Ltd - Irish Company Info - SoloCheck Login Join 0 items Added to your basket No Items in your basket! 0 Items in your basket Checkout Uncle Fast Food Limited Updated: 9 hours ago 99 Views Add My Company Details Tweet Share Facebook LinkedIn Email Vitals Directors Judgments Documents Summary Uncle Fast Food Limited was set up on Tuesday the 18th of January 2022. Their current partial address is Dublin, and the company status is Normal. The company's current director has been the director of 1 other Irish company. Uncle Fast Food Limited has 2 shareholders. Company Vitals Company Name: Uncle Fast Food Limited Time in Business: 3 Years Company Number: 711829 Company Size: Small Company Current Status: NORMAL Principal Activity: [5610] Restaurants and Mobile Food Service Activities May Trade As: Silky Sips Express Fish & Chips Takeaway Add My Company Details Registered Address: 39 Abbey Road , Kill of Grange , Monkstown, Dublin, Ireland Standard Report Full Company Vitals, including Directors & Mortgages View a sample report €3 Directors Purchase either the Standard Company Report or a Credit Report to view details on the directors of this company. Documents Document Pages Effective Received Buy FINANCIAL STATEMENT 7 18/07/2025 11/09/2025 Form B1C - Annual Return General 4 18/07/2025 11/09/2025 Form B1C - Annual Return General 4 18/07/2024 12/09/2024 FINANCIAL STATEMENT 7 18/07/2024 12/09/2024 FINANCIAL STATEMENT 6 18/07/2023 04/08/2023 Form A1 - New Company Incorporation 6 18/01/2022 14/01/2022 Certificate of Incorporation 1 18/01/2022 14/01/2022 This company has 2 other documents » Ratings and Reviews Be the first to review this company! Your Rating: Click on the stars below to rate this company 1 2 3 4 5 Enter your email Company Interaction Please select Bought From Company Supplied To Company Your First Name: Your Location: Press submit below to record your opinion, first name and county. Quick, Reliable and Confidential Company Reports, Credit Ratings and Judgment Searches. WHY GET A REPORT? Make more informed decisions Protect against bad debt Make sure your deposit is safe Reduce invoice payment times Check your competitors SEARCH Location Ireland UK Intl Companies Directors Search Companies Search Directors Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia, Plurinational State of Bosnia and Herzegovina Botswana Brazil Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Colombia Comoros Congo Congo, the Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czech Republic Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands (Malvinas) "
    },
    {
        "url": "https://www.yelp.com/search?cflt=hotdogs&find_near=centra-corduff",
        "title": "yelp.com",
        "text": "yelp.com Please enable JS and disable any ad blocker"
    },
    {
        "url": "https://www.facebook.com/groups/brayopenforum/posts/2780692572129574/",
        "title": "Bray Open Forum | Does anyone know when the new Greek place \"Fredi's Pita\" is opening",
        "text": "Bray Open Forum | Does anyone know when the new Greek place \"Fredi's Pita\" is opening"
    },
    {
        "url": "https://www.huntbrotherspizza.com/",
        "title": "Welcome to Hunt Brothers® Pizza",
        "text": "Welcome to Hunt Brothers® Pizza ( Find Location ) Contact Us LIMITED TIME ONLY Find A Location Find Your Next Pizza. Search Hunt Brother's Pizza Download our Pizza App Click the button below to Download the new Hunt Brothers Pizza App. Download on the App Store Get it on Google Play Partner with Us and Increase Profits Partner with the #1 pizza brand in the convenience store industry. Our branded pizza program makes foodservice easy to set up, easy to make, easy to sell, and easy to profit from Hunt Brothers® Pizza. Learn more We love racing as much as we love pizza. Become part of the E-Club family Stay up to speed on new pizzas, giveaways, racing updates, and more. Join Today!"
    },
    {
        "url": "https://en.wikipedia.org/wiki/Fast-food_restaurant",
        "title": "Fast-food restaurant - Wikipedia",
        "text": "Fast-food restaurant - Wikipedia Jump to content Search Search Fast-food restaurant 35 languages العربية تۆرکجه Banjar Čeština Dansk Deutsch Eesti Español Esperanto فارسی Français 한국어 Հայերեն Bahasa Indonesia Jawa Ikinyarwanda Magyar Bahasa Melayu မြန်မာဘာသာ Nederlands 日本語 Norsk bokmål Português Русский Simple English کوردی Српски / srpski Suomi Türkçe Українська Tiếng Việt 文言 粵語 中文 Betawi Edit links From Wikipedia, the free encyclopedia Type of restaurant A fast-food restaurant in the port of Malinska , Croatia A Hesburger fast-food restaurant in Tapiola , Espoo , Finland A McDonald's restaurant in New York City A Café de Coral restaurant in Hong Kong A fish and chip shop in Broadstairs , England A fast-food restaurant , also known as a quick-service restaurant ( QSR ) within the industry, is a specific type of restaurant that serves fast-food cuisine and has minimal table service . The food served in fast-food restaurants is typically part of a \" meat-sweet diet \", offered from a limited menu, cooked in bulk in advance and kept hot, finished and packaged to order, and usually available for take away , though seating may be provided. Fast-food restaurants are typically part of a restaurant chain or franchise operation that provides standardized ingredients and/or partially prepared foods and supplies to each restaurant through controlled supply channels. The term \"fast food\" was recognized in a dictionary by Merriam–Webster in 1951. [ 1 ] While the first fast-food restaurant in the United States was a White Castle in 1921, [ 2 ] fast-food restaurants had been operating elsewhere much earlier, such as the Japanese fast food company Yoshinoya , started in Tokyo in 1899. [ 3 ] Today, American-founded fast-food chains such as McDonald's ( est. 1940) and KFC (est. 1952) [ 4 ] [ 5 ] [ 6 ] [ 7 ] are multinational corporations with outlets across the globe. Variations on the fast-food restaurant concept include fast-casual restaurants and catering trucks . Fast-casual restaurants have higher sit-in ratios, offering a hybrid between counter-service typical at fast-food restaurants and a traditional table service restaurant. Catering trucks (also called food trucks) often park just outside worksites and are popular with factory workers. [ citation needed ] History See also: History of the hamburger , White Castle (restaurant) , and History of McDonald's The examples and perspective in this section deal primarily with the United States and do not represent a worldwide view of the subject . You may improve this section , discuss the issue on the talk page , or create a new section, as appropriate. ( April 2012 ) ( Learn how and when to remove this message ) In 1896, the first self-service restaurant (the \"Stollwerck-Automatenrestaurant\") opened in Berlin's Leipziger Straße . [ 8 ] United States The Big Mac hamburger made its debut in 1967. The Burger King Whopper sandwich made its debut in 1957. Some trace the modern history of fast food in the United State"
    },
    {
        "url": "https://www.reddit.com/r/Bolehland/comments/1ffoqjp/uncle_roger_restaurant_receiving_so_many_negative/",
        "title": "Reddit - The heart of the internet",
        "text": "Reddit - The heart of the internet Skip to main content Go to Bolehland r/Bolehland r/Bolehland Wow Members • masterpieceOfAMan 繁體中文 Dansk Svenska Українська Polski 한국어 Filipino Norsk (Bokmål) Română ไทย Italiano Uncle roger restaurant receiving so many negative comments ! Is this competitors/Haters just hating or is it actual customers who are rating him ? Read more Share New to Reddit? Create your account and connect with a world of communities. Continue with Email By continuing, you agree to our User Agreement and acknowledge that you understand the Privacy Policy . Wow Public Anyone can view, post, and comment to this community 0 0 Top Posts Reddit reReddit: Top posts of September 13, 2024 Reddit reReddit: Top posts of September 2024 Reddit reReddit: Top posts of 2024 Reddit Rules Privacy Policy User Agreement Accessibility Reddit, Inc. © 2025. All rights reserved. Expand Navigation Collapse Navigation"
    },
    {
        "url": "https://www.instagram.com/reel/CsHTuLTpmVF/",
        "title": "Instagram",
        "text": "Instagram"
    },
    {
        "url": "https://www.instagram.com/p/DANo5JboODG/",
        "title": "Instagram",
        "text": "Instagram"
    },
    {
        "url": "https://www.thesun.ie/news/16093608/missing-man-mystery-suspicious-sinister-sister-fears-gardai/",
        "title": "Last Dublin sighting, sister's 'sinister' fear & 'people of interest'...major Anthony Hanlon 'suspicious' case latest",
        "text": "Last Dublin sighting, sister's 'sinister' fear & 'people of interest'...major Anthony Hanlon 'suspicious' case latest The Irish Sun Irish Sun UK Edition US Edition Scottish Sun Search Search Sign in My Account Sun Club Exclusive News Irish News MILESTONE NEARING Last Dublin sighting, sister’s ‘sinister’ fear & ‘people of interest’…major Anthony Hanlon ‘suspicious’ case latest It’s also understood cops have also identified 'people of interest' in the case Stephen Breen , Irish Sun Crime Editor Published: 21:00, 12 Nov 2025 Click to share on Twitter (Opens in new window) Click to share on Facebook (Opens in new window) GARDAI are now treating the case of missing man Anthony Hanlon as “suspicious”, it has emerged. The 39-year-old’s sister Jessica was told last week that a Senior Investigating Officer has now been appointed to investigate the case. Advertisement 7 Anthony Hanlon has been missing since last December 7 His sister Jessica fears ‘something sinister’ happened to him 7 CCTV footage captured Anthony’s last known movements Although a number of extensive searches were undertaken in the Drogheda area in Louth and also in Dublin, gardai have been unable to locate him. The search focused on the capital after it emerged he was seen at the PTSB on O’Connell Street. But gardai later established that he had then boarded a bus on the same day. Anthony was last seen alive boarding the Expressway bus in Dublin to Drogheda on December 3. An incident room relating to his disappearance has now been established in Drogheda Garda station. It’s also understood they have identified “people of interest” in the case. Detectives will also re-interview everyone who has provided statements on the case. Advertisement And as the first anniversary of his disappearance approaches, his sister has told of her torment . She said: “It’s almost a year now and we still don’t have any answers. “I have said from day one that I think something sinister has happened to him and I welcome the appointment of a senior investigating officer. “We can’t go through another year of this hell and we just need someone to come forward. 7 Extensive searches were carried out in both Dublin city centre and in Drogheda 7 The first anniversary of Anthony’s disappearance is fast approaching 7 Anthony was last seen boarding an Expressway bus in Dublin “He would never have left so long without contacting us and there must be people out there with information. “The fact it is now being treated as suspicious has confirmed our fears and we just want to know what happened.” We also understand Gardai are following two complex lines of inquiry in the case. Advertisement They are that he fell into the Boyne river or may have been harmed. Officers have also followed an additional 15 lines of inquiry and taken 20 statements. And his DNA has also been sent to Wales after the remains of a man were found washed up on a beach. Anthony has also been described as being in a “vulnerable state” at the time of his "
    },
    {
        "url": "https://www.tripadvisor.com/Attraction_Review-g212509-d5991636-Reviews-Uncle_Tom_s_Cabin-Dundrum_County_Tipperary.html",
        "title": "tripadvisor.com",
        "text": "tripadvisor.com Please enable JS and disable any ad blocker"
    }
]